[{"personality": ["Tell me more about the situation?", "Has this happened before in the past?"], "utterances": [{"candidates": ["You seem to have been a very positive influence in your kids' lives.They may have worked so hard because they understood how difficult and tiring your life was as a single mom.I feel you are seeing your kids' lives through the measurement of how much toil was in your life as a single mom.In other words, what you see your kids overlooking or not appreciating, may remind you of your wishes during the many years you raised your kids.If it helps you and is possible, then maybe you could spend more of your own time tougher with your grandkids.  This may give some reward for the many years you spent working to support your kids and had no choice in the amount of time you had with your kids.As far as your kids relationship to their kids, it is now their turn to raise them as they wish, within ethical boundaries of course.Depending on the topics you and your kids talk about, consider to bring up your concern as to whether they feel their kids, your grandkids, are missing anything due to the limited time they have with the parents."], "history": ["I was a single mom most of their growing up life and have guilt about trying to work three jobs and being gone a lot. My children are successful with their own business's, have lots of nanny and cleaning help, but I just feel they have such a great opportunity to spend it with their kids."]}, {"candidates": ["Hi New York, I'm happy to hear that your daughter doesn't know about her dad's addictions. Although you don't say how old she is, and I imagine that at some point in her life she will be ready to know the truth, I trust your instinct that now is not the time. Your ability to have clear boundaries about what is adult conversation and what is suitable for a child to know are really important here, and I can tell you're being appropriately protective and a thoughtful parent. As much as this helps your daughter, I sense that you also know you can't take away the emotional pain that comes from having an absent parent. Children tend to blame themselves for a parent's absence. These children need extra love and support wherever they can get it.You say that you feel like there is a wedge between you and your daughter. I understand that having your ex partner's relatives in the same home would make it uncomfortable at times. It is very important to establish boundaries; only you should parent your daughter, but it's also natural for people to want to assist you. Let's trust that their intentions are good, if there is no evidence to the contrary. As much as they support you, they also  have emotional ties to your daughter's father. While there is potential for discomfort in this complex situation, there are also many positive factors here that I invite you to see.I don't know what your culture is, but for your daughter to have the opportunity to preserve her father's heritage language and a relationship with his family are potentially wonderful additions to her life. In general, the more adults around loving and supporting a child, the better. It could be that you are feeling threatened by small moments where there appears to be a special connection between your daughter and her father's family. Nothing anyone else does can take your daughter's love from you. My hope for you is that you can feel so secure in your own position as loving mother that you will not feel intimidated by other positive connections your daughter has. They are potentially wonderful connections, and she deserves your support in maintaining those relationships if they don't harm her.I suggest that the most important alliances to work on here are between you and your ex's family. If you could all give your daughter the gift of a healthy, united supportive and loving safety net for her...that's the best outcome of all."], "history": ["We live with my ex-partner’s sister and her husband. We have been there for five years now. They are Hispanic and talk to my daughter in their language. Sometimes they overstep their balance between aunt and uncle and reach into my role as a parent. They neglect to see this. I do, and it reflects in my child's behavior. She sees them as stable but is upset that her dad isn't here, and my intuition tells me she blames me to a degree because she doesn't know about his alcohol addictions."]}, {"candidates": ["Hi Fontana,Thanks for providing all the details needed in order to respond to your question. It seems very clear to me that \"no\" would be the appropriate response. I like your healthy boundaries, and I'll help you explore possible ways to respond to her. First, she hasn't asked yet, and you don't know that she will. Right now, you can pleasantly ignore her hints. They're not hurting you and if you ignore them, they're more likely to go away. You can address and reduce your own anxiety about the possibility of her asking by reassuring yourself that you have the right as parents to make this decision, and that if she's offended, that doesn't mean that you're being mean; it means that she has unrealistic expectations. So, the first goal is to put it out of your mind as a worry. You might never have to face that moment. But, I understand that you want to be prepared.As her son, perhaps your husband is the best one to answer the question, should it ever come. Is he willing to do this? But if you are comfortable, and if you're the one she asks, you can confidently give her a simple, honest response about why it won't happen. And I would suggest presenting a firmly closed door, rather than saying \"but maybe later\". No need to apologize or hum and haw...\"We love that you want to be around Junior, and we definitely want you in his/her life. (try to leave out the \"but\" here). You're not in a healthy place, and we're not comfortable with you caring for him/her on your own.\"If she pushes the issue, this is evidence of her denial or inappropriate boundaries. I'd let her know that it's not negotiable, that you understand if she's disappointed, but you're not open to discussing the issue. Really, there's nothing to discuss. Learning not to take responsibility for her emotions is part of having an ill person in your life. I wish you the best."], "history": ["My mother-in-law is mentally ill. She has been for most of her life. She cuts herself. She has been in and out of psychiatric hospitals for about 40 years. She has voices in her head that tell her to cut herself. She has had multiple shock therapy treatments, and she’s on enough medication to take down an elephant. Her parental rights for her two children were taken away from her when my husband was a boy—he is now in his late 30s. She doesn’t even have custody of herself. She hasn’t asked yet, but she has been insinuating that she wants to babysit my child. How do I go about saying no without creating an issue?"]}, {"candidates": ["That is a good question. Unfortunately there is no generic answer with this one. Kids fight for different reasons - wanting attention, wanting respect, feeling jealous, wanting space and to be left alone, or a whole bunch of other reasons. Regardless of the underlying motivations for fighting, most conflicts result from misunderstandings and assumptions about the motivations of others and one of the best ways to start figuring out what is going on is to sit them down and have some conversations with them. These conversations should be centred on getting a better understanding of why they are angry with each other and really understanding them. It is important that they each know that you are committed to understanding their experience rather than simply sitting them down and lecturing them about what they are doing wrong. The more they are able to understand each other and feel understood the more likely they will be cooperative and considerate of each other. One exercise for doing this that can be very helpful is \"active listening\" where one person speaks and the other person reflects back what they heard the other person say and then checks for understanding. This is hard to do but it often illuminates where the misunderstandings and assumptions are. If this doesn't work it may be time to get a family therapist or counsellor involved who can help facilitate dialogue and resolve conflict."], "history": ["For the last year, my adolescent son and daughter have been driving me nuts with fighting. I'm at my wits end. How can I get them to stop and get along?"]}, {"candidates": ["Moving on is the right question. Everyone's different in moving on. First, what can I learn about myself because of this painful time? Caring non-judgmental family and friends who listen with the head and heart help a iot. Other times I need a skillful, caring professional to help me move on. You will find a way because you've asked the right question. Dr. Spencer"], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["The termination of a relationship can be a challenge to heal from. Having obsessions after a breakup are very normal and many of my clients experience them. It can help to create a distraction box and when the obsessions present themselves use your distraction activities. In the beginning try to distract from the obsessions for 5 minutes and work to increase that time over time. Celebrate your successes when you are able to distract yourself."], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["Initially, everything is a reminder because there is a trace of that other person present in everything in your life. When we lose someone, we're saying goodbye to what we thought our future was going to be.  Accepting that's changed and allowing ourselves to envision a new future is necessary to \"move on\". Start learning something new or try a new activity that you've always wanted to do.  Find whatever is \"good\" about being out of the relationship and focus on those things.  This can be an exciting time of transformation for you.   As time goes by, you'll add new things in your life that aren't entwined with this relationship and those things will begin to crowd out those things associated with the relationship.  Give yourself a little empathy, no one goes through a breakup without being sad.  It's ok to be sad.  It's even ok to feel devastated.  Loss of a relationship touches a primal need we have to belong.  It makes us feel insecure, unanchored.  In truth, we are ok, safe even.  This experience will open different perspectives for you.  There are lessons you'll take from it that will add another facet to you as a person.  Maybe in time, you'll even appreciate this experience.  I'm sorry you're hurting right now.  Best wishes to you, Allison"], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["Dealing with a breakup is difficult. We have high hopes and then those hopes and dreams are dashed and we feel at a loss for how to deal with this sudden change in our lives. First, it is important to acknowledge that losing a relationship is a loss and we need to grieve that loss. If we don't allow ourselves time to process and move through the grieving process, we may remain stuck and it may make it hard to move on. So in some ways, you don't want to move on too soon by just trying to ignore your feelings. Instead, take good care of yourself, talk to friends and give your self time to heal. The second most important thing is to forgive yourself; this is also an important part of taking care of yourself. You might be blaming yourself and re-living moments when you wish you would have done things differently. By replaying those thoughts you remain stuck. When we begin to forgive ourselves, we truly begin to heal. Lastly, in my experience the people who have the most difficulty moving on have not really severed all ties with their ex. They are still following them on social media or even checking in with texts. This is probably the hardest part for some people, but to move forward there needs to be a clear boundary and a clear ending. If you have a clear ending, you can have a new beginning. I hope this helps. Take good care of yourself!"], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["Relationships can be extremely enjoyable and satisfying.  When relationships end, however, it can be devastating.  It is normal to go through a grieving process after a breakup.  Denial, bargaining, sadness, anger and eventually acceptance are all normal stages of grief.  You may experience these feelings all at once or one at a time.  Allow yourself time to grieve by expressing your emotions - talk to a friend or write in a journal.  Take care of yourself during this time by exercising, eating and sleeping well and spending time with friends.  After some time you should start feeling better.  If you feel like you're not feeling better and you don't know what to do, you can see a therapist to help you get through this difficult time."], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["Breaking up can be a very difficult thing.  I'm sorry you're feeling badly.    The first thing is to be really sure you are taking care of yourself --- that means eating well, exercising, getting good sleep, spending time with friends/family and making sure you are taking care of important things like work, rent, bills etc.    Secondly, it's important to do things that make you feel better and not worse.   If looking up your ex on social media makes you feel worse stop doing it!   It's important to concentrate on you and not them.    Thirdly, it's super important to make sure you're really looking at the situation accurately and look for the good things that still exist in your life ---  what is still good?   Even though your emotions are hurting and you are feeling badly, can you see the light at the end of the tunnel?  Do you feel hope?  If you do try to concentrate on that hope feeling.   If the obsessing continues and really gets in the way of living your life?   Maybe contact a therapist or counsellor that can help you through this difficult time?"], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["Hi, Break ups can be very devastating and even traumatic. Recovering from one is a process that is unique for everyone person and will take time. It's important that you don't compare yourself to others. Each and every person will experience this grieving process differently. Here are a few tips to help with your recovery: 1. Make sure you surround yourself with people who love you and support you, friends and family. Even though you might feel like being alone, make an effort to be around them. 2. Although you might not feel like it, try to take care of yourself as much as possible: eat healthily, get regular sleep, & vigorous or gentle exercise (depending on your mood). The last thing that we want to do when we are physically sick (e.g. flu) is to take care of ourselves even thought that's what we need the most. But when we do get that chicken broth, sleep and vitamins we recover much faster and with less discomfort. That's exactly the same when it comes to emotional pain. Take care of yourself, keep yourself strong and healthy so you can recover faster. 3. As much as possible, put away reminders of the relationship. You might not be ready to throw things out, but try to put them away in a box in the storage or in a closet. And also block Social Media reminders. There is a lot of wisdom in the saying \"Out of Sight, Out of Mind.\" 4. Once the initial shock and intensity of the break up wear off, try out something new. In a relationship, we often forget and give up on things that we always wanted to do or to try. Now it's time to bring out that dusty bucket list and start trying something new. 5. If possible, change your scenery by going away on vacation with a friend or even by yourself. Changing your surroundings can really help you change your thoughts, mindset and forget your ex even if just for a few hours. Even a weekend getaway with a couple of girlfriends can do wonders. 6. In addition, to help you make sense of your past relationship and what went wrong, I would highly recommend seeing a professional counsellor or therapist."], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["The best way to move on is to give yourself sufficient time and space away from your ex so you can heal.  That means no checking out your ex on social media platforms and no contact.  In order to move on and diminish the obsessions, help yourself recognize and accept that the relationship is over, and make sure to get sufficient support in processing all your feelings.  Once that takes place, it can be useful to explore and process with a professional the meaning of the relationship and to understand your part in what transpired.Sometimes people obsess because they have difficulties accepting what's already taken place and want things to be different.  The key to moving forward is to be loving toward yourself, to give yourself permission to grieve the loss, and to start cultivating new and healthy habits/patterns.  Reengage in your present life, ask yourself what you want your life to look like, and start creating goals and taking small steps to create the amazing life you want for yourself."], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["Let yourself know what you feel.   There is no timetable or known length of how much time a particular person requires in order to feel that the dissolved relationship is behind them.Probably the more you allow yourself to acknowledge your sadness from seeing the reminders, the sooner you will feel fresh and new again."], "history": ["I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?"]}, {"candidates": ["Hello, and thank you for your question. Boy, ending relationships is tough, isn't it? Sometimes it's tough even when we are 100% sure that it is the right thing to do!I am going to give you some of my thoughts, and hopefully some colleagues will add some others. One of the things that I want to point out is that \"letting go\" is not really a thing. In other words, it's not really something you can reach out and grab. It's more of a process. This is good news, because you don't necessarily have to be at the end of the process to end an unhealthy relationship. We just have to accept that there will be feelings that come up even after the relationship is over. For example, someone can end an unhealthy relationship today, but then be reminded of the good times on what would have been their \"anniversary.\" This could make the person very sad. They may even regret ending the relationship for a little while. It would important, then, for the person to remind themselves why the relationship needed to end, and that they are healthier because of it. This is relevant for you. It's hard to walk away from a relationship. We fear all kinds of things, including being single! Sometimes it's helpful to compare what you are getting out of the relationship to what you want from a relationship. It's helpful to be honest about what we have given up for an unhealthy relationship. It's fine to admit uncertainly about ending things. It's okay to be afraid. It's okay to have moments of doubt and sadness along with a dash of guilt. And even with all of that, someone can still leave if it is the healthiest thing for them. They can have sadness later on, and still not go back.It sounds like you are feeling responsible for making sure he is okay because of this divorce. The truth is that there is not necessarily a \"perfect\" time to end any relationship. There would be no guarantee that he would be doing any better after the divorce. Sometimes NOT making decisions stresses us out A LOT more than making a decision and living with the consequences, both good and bad. You may be at that crossroads. Be well..Robin J. Landwehr, DBH, LPC, NCC"], "history": ["Ive been in an on an off relationship with a this man for almost 3 years. Even though I care about him, he continues to hurt me.    He and his wife were separated when we met. Now he's going through a really difficult divorce from her and is taking it really hard. I want to end this relationship, but I don't feel like I can. How can I let go?"]}, {"candidates": ["First decide what you truly would like in the current relationship. Understand your reasons for staying in the relationship.Three years is a substantial amount of time to be involved with someone.   Whatever attachment you feel toward this man is deep and complex.Instead of deciding to leave or not leave, change your question to figuring out your satisfactions and dissatisfaction with the man. Also important is to tell the man your feelings.Whatever problem you are feeling may become clarified by discussing what bothers you.At the very least, you will give the guy a chance to show how interested he actually is in the tension you currently feel and have felt for a while."], "history": ["Ive been in an on an off relationship with a this man for almost 3 years. Even though I care about him, he continues to hurt me.    He and his wife were separated when we met. Now he's going through a really difficult divorce from her and is taking it really hard. I want to end this relationship, but I don't feel like I can. How can I let go?"]}, {"candidates": ["Hi Attica,This is a question I think a lot of people deal with...they feel confusion about why they can't forget about or get over (or stop connecting with) someone who they absolutely know isn't good for them. In your case, part of the problem is that he keeps trying to get back in touch with you. For some people, honestly, it's a game... to see how much power they have over you or it's their need to control you. If you don't want contact from this person, it's really important to give him clear messages about boundaries (\"Don't contact me again\"), and then ignore all of their communications. Any interactions or responses from you at all will feed their behaviour. Remind yourself why you don't want to be with them. I hear you doing that already when you say \"he has nothing to offer me\". That's great self-talk.But let's get back to the question of why we have a hard time letting go of people like this. Sometimes it's because we still hope they will change. Maybe we remember who they used to be or how they used to treat us, and we think it can go back to the way it felt in those \"good old days\". The problem there is that, over the first few years, as intimacy grows, people tend to show more of who they are, not less. So what they're eventually showing you is who they are and what they're capable of. People do change and grow, but it won't happen at your pace. Accept that person for who they are and stop expecting them to change. Another reason we can't let go is because we picture our ex with someone new in the future and we wonder if they will be a better person for the next partner in their life. This is a normal... but not a healthy... thought. It's as though we want them to stay, maybe apologize, and heal our hurts; maybe make up for past mistakes. You deserve that healing, you deserve better than you got, you deserve apologies, but to expect that from the person who hurt you and hasn't demonstrated that compassion as yet is probably foolhardy. It is my belief that underlying some of the above scenarios is the deep belief that we must somehow be responsible for the hurts our exes have caused. If you blame yourself in any way for someone's poor treatment of you, you will be dancing around trying to do things differently so that they can treat you better. It will be impossible to let go, because you blame yourself for their behaviours.Draw a line. Their behaviours are about them, not you, and the only solution is to challenge and reduce thoughts of them, and create physical and emotional distance. These things plus time will help the events of the past fade from importance."], "history": ["My ex-boyfriend boyfriend and I lived together. He had a two year affair with a girl and had three pregnancies with her. One was an abortion, another was a miscarriage, and then she had the third baby. They are not together, but he continues to contact me and wants me back. He has nothing to offer me."]}, {"candidates": ["Major change frightens almost everybody.Don't be so afraid of your fear that you let yourself beg and are willing to accept unhappiness as a standard in your marriage.If you start considering that life can be better than what is current for you now, new possibilities and ideas will start developing in your mind.Consider finding a therapist so that you have private space to talk in detail about your fears and the new ways of seeing your Self.A therapy relationship, since it is safe and supportive, will be a good balance to having been abused, suffered, and unhappy."], "history": ["I keep on begging him to come back. I am so unhappy with him but am so scared of being a single parent to our son. I was abused as a little girl and that has made to be very abusive to men. What should I do..."]}, {"candidates": ["I’m glad that you  are seeking help and that you are supporting your friend. I’m sure this is all overwhelming and frustrating for you. The biggest thing you can do for your friend is to be supportive as you are already doing. Unfortunately there isn’t much you can do for her outside of that because it is up to her husband to change and up to your friend if she wants to leave. There are things you can do to support more: it might be helpful for her to have some information on a domestic violence non profit in her area because they can assist her in many areas if she wants to leave. They can also provide you with support while you go through this with her. The nonprofit can also safety plan with her and it might be helpful for you to do it with her if you want to. Another thing you can do is support her in decision to stay with her husband or not despite what she decides. Many victims decide to stay with thier abusive partner for many reasons. It is important to support her decisions, even if you don’t agree with them, because she may have very little decision making in her relationship. I would also encourage you to make sure you are taking care of yourself while you support her so you are not becoming too overwhelmed. Here is some info that might be helpful to you. https://abuseintervention.org/sandbox77/wp-content/uploads/2012/03/How-to-Help-a-Loved-One.pdf"], "history": ["My friend’s husband is bipolar and refuses to take medication for it. He has taken the wheels off her vehicle before to prevent her from leaving. He has held her a prisoner in her home. He has choked her, hit her, etc. She has almost divorced him a couple of times but always makes up with him, thinking that he is going to change. She and I went to a wedding out of town in September of 2014, and ever since she has been back, he is convinced that she cheated on him while we were gone. Now he is saying that I have also cheated on my boyfriend and has come to my house and told my boyfriend this."]}, {"candidates": ["That sounds like a very hurtful situation. Unfortunately, without a batterers intervention course or a desire to change, the abuse cycle is unlikely to stop. I do not recommend that you try to leave on your own due that being the most dangerous time when in an abusive relationship. As an abuser, his goal is to control you whether it's through mental or verbal means. I recommend that you contact a domestic violence shelter in your area. I have worked closely with Harbor House of Central Florida and know they provide housing, transportation, and any other needed resources to women leaving an abusive relationship. There is help out there and you are not alone. If you need any additional resources in your area, please don't hesitate to contact me."], "history": ["I've been with my boyfriend over 3 years. He cheated on me and the woman is now pregnant. He is physically and mentally abusive towards me. I have attempted to talk with him in order to resolve our issues; however, he never wants to talk and often blames me for everything. I’m always there when he needs my help. He tells me although I help him doesn’t mean that I am a good person. He always discredits me as a woman and it’s hurtful. I spend most day crying and feeling lonely. I am unhappy and unsure of what I need to do."]}, {"candidates": ["Hello, I commend you for your courage in taking a look at the role alcohol has in your life. It sounds like you're concerned about what happens when you drink too much and I suspect you already know the answer to your question about whether you have a problem or not. I imagine you would like to stop feeling guilty and would like to avoid cheating on your boyfriend or other negative consequences and maybe have a fear of being or becoming an \"addict\" or \"alcoholic.\" You might have a \"problem\" but that does not necessarily mean that you are an addict. I don't have information to know if \"addiction\" or \"dependence\" or other words would best describe where you are with drinking, but it sounds like it's begun to have some negatives, so forgive me using words like addict, dependence and so on. I mean it more as a road map than a diagnosis. The feedback I'm writing here is very general and doesn't address physical dependence and many other factors that might apply to your situation.  One of the ways to think about substance (mis)use is to think of addiction as a disease of avoidance. Let me repeat that: it is a disease of avoidance. Your ultimate task in living a balanced life is to figure out what you're avoiding and develop other ways to manage those feelings, experiences, and so on. And of course, along the way, you may want to look at triggers, situations, biological vulnerability, social pressures, coping skills, relapse prevention planning and so on. Depending on where you are in your drinking, you might very well benefit from expertise and support. Remember also that alcohol depresses our central nervous system and disinhibits us. That means that alcohol is often a substance of choice to relax, destress, calm down, etc. Also, it allows feelings, thoughts, and behaviors that we usually inhibit to be expressed. If you were unfaithful and often angry, that's your first signpost. For angry drinkers, it is often true that you don't drink and then get angry, you drink in order to express anger. I recommend you find someone you can speak frankly with, who is knowledgeable about addiction. Wishing you the best health and wellness."], "history": ["I'm a female in my mid 20s. Lately I tend to over drink and I've become a very angry drunk.    In the past, I have even cheated on my boyfriend while I was under the influence of alcohol.    But now, even if I don't do anything wrong and don't embarrass myself, I still feel really guilty after a night of drinking. I don't understand why I'm feeling this way. Does this mean I have a problem?"]}, {"candidates": ["The short answer is yes - if you feel 'really guilty after a night of drinking', then you probably have a problem. What you could do is visit this website by the National Institutes of Health: http://rethinkingdrinking.niaaa.nih.gov/How-much-is-too-much/  There you will find information on how many drinks is too much, and the general answer for women is more than seven drinks in a week. There is also a quiz you can take anonymously that will help you determine if your drinking is a problem. The good news is that you can get help for substance abuse through counseling, self-help programs, or alcoholics anonymous."], "history": ["I'm a female in my mid 20s. Lately I tend to over drink and I've become a very angry drunk.    In the past, I have even cheated on my boyfriend while I was under the influence of alcohol.    But now, even if I don't do anything wrong and don't embarrass myself, I still feel really guilty after a night of drinking. I don't understand why I'm feeling this way. Does this mean I have a problem?"]}, {"candidates": ["Guilt is a narcissistic, self-indulgent focus on me, me, me; it's best not to keep it in negative light;What does that mean?  Well, it stems from mankind having an animal nature, and a spiritual nature;In most societies today, the animal nature is looked down upon, seen as egregious and something to be put away;If I may say to you, it is necessary and important (if you wish to end an experience called \"guilt\") to NOT regard your animal nature as negative, but to accept that you have it, and acknowledge it;The more openly a man or woman acknowledges they're animal-side, the quicker one may subdue it;Try giving your animal nature a name, and talk to it like a cute pet... \"Oh, hey, there, Snorky!  Oh, what's that?  You want to be a wealthy, famous Hollywood idol?  Oh, really!  Agaiiiiiiin, Snorky!  Geez, you're impossible!  Ain't you just the cutest thing!\""], "history": ["I'm a female in my mid 20s. Lately I tend to over drink and I've become a very angry drunk.    In the past, I have even cheated on my boyfriend while I was under the influence of alcohol.    But now, even if I don't do anything wrong and don't embarrass myself, I still feel really guilty after a night of drinking. I don't understand why I'm feeling this way. Does this mean I have a problem?"]}, {"candidates": ["I offer that getting a professional assessment is in order to look at your relationship with alcohol."], "history": ["I'm a female in my mid 20s. Lately I tend to over drink and I've become a very angry drunk.    In the past, I have even cheated on my boyfriend while I was under the influence of alcohol.    But now, even if I don't do anything wrong and don't embarrass myself, I still feel really guilty after a night of drinking. I don't understand why I'm feeling this way. Does this mean I have a problem?"]}, {"candidates": ["Speaking with a licensed therapist will help you figure out if indeed you have a problem or not.  I would say the first question you should ask yourself is why you are drinking? The second would be why you feel the need to drink in excess? It may be due to a life event or the crowd you are running with.  Either way a therapist will be able to help you through this as you already made the first step in admitting you are having a difficult time."], "history": ["I'm a female in my mid 20s. Lately I tend to over drink and I've become a very angry drunk.    In the past, I have even cheated on my boyfriend while I was under the influence of alcohol.    But now, even if I don't do anything wrong and don't embarrass myself, I still feel really guilty after a night of drinking. I don't understand why I'm feeling this way. Does this mean I have a problem?"]}, {"candidates": ["Usually when someone asks if they have a problem, they believe they do have a problem!The first step is to understand your own theory and definition as to what problem you feel you have.  Some possibilities are feeling unhappy in the relationship to your boyfriend, not having enough discussion between the two of you, not feeling cared about by your boyfriend, not liking your boyfriend.Did you grow up in a family in which the grownups drank to the point of excess at the times they felt stressed?Family modeling of how to handle problems may have left you no knowing how to handle stress except to drink to excess.Ask yourself what it is you feel guilty of doing?The guilt may point you in a good direction if it is your sense of self-esteem telling you to find better ways of managing your life.Do you drink alone or together with friends?Try defining your specific reasons for drinking because this is the first step to know how to handle the situation differently."], "history": ["I'm a female in my mid 20s. Lately I tend to over drink and I've become a very angry drunk.    In the past, I have even cheated on my boyfriend while I was under the influence of alcohol.    But now, even if I don't do anything wrong and don't embarrass myself, I still feel really guilty after a night of drinking. I don't understand why I'm feeling this way. Does this mean I have a problem?"]}, {"candidates": ["Hello, and thank you for your question. This is one of those times when you wish you could assure someone that everything will go perfectly, but unfortunately I can't do that. There is no way of knowing how parents might respond until you tell them. The truth is that people have come out to their parents in many different ways. Some have told their parents directly, some drop hints, some have had others tell their parents, etc. The only \"right\" way to come out is the one that you choose. The one that feels right to you. That is the best way. Some people decide not to come out, and some wait for a very long time. Both of these things are okay. Coming out is deeply personal, and there can be real consequences to someone's emotional health and safety if they tell the wrong person. That is why it should only be done when you are ready. When you feel that you have the emotional and personal support that you need to take the risk. Sometimes people can feel pressured to come out, but I encourage you to do it in your own time. The truth is, there is a spectrum of how people's parents react to this kind of news. On one end, you may have the parents who shut a person out and are abusive, and on the opposite side you may have parents that are totally okay with it and throw you a \"Coming Out\" party. Most parents are going to fall somewhere in the middle. It is important to remember that their feelings may change over time. Many parents struggle at first, but they love their kids and get better with it over time. If you decide to tell them, consider taking someone along to support you. Plan ahead on what you want to say. It can be an emotional time, so do what you need to do to take care of yourself. If you need to, leave. You don't have to stay anywhere where someone is being cruel to you. I wish you well, and good luck.Robin J. Landwehr, DBH, LPC, NCC"], "history": ["I'm in love with my own gender, and my parents are against that. I don't know how to tell them because I'm afraid they'll not want me anymore."]}, {"candidates": ["Hi Florida,I get the sense that, aside from this relationship, you're quite isolated in general. It's sad that you're feeling excluded at Christmastime and family events. While I would suggest that you don't really know what he or his family are thinking or feeling (you assume they're against you, and that he doesn't care), he is certainly behaving in a very distant, excluding manner and it's understandable that you would feel rejected and hurt. How long has this part been happening? Has he always acted this way, or is it more recent? Did something happen recently? You mentioned doing \"stupid things to yourself\", and I don't know what that means. If you are engaging in self-harm he may be confused about what to do and he might need some time to think and be separate but is having trouble talking about this. Part of the problem, of course, is that you don't know what's going on for him. Certainly, you deserve the truth, and if he doesn't want to spend time with you, I would hope he would be honest. Have you been open to hearing the truth from him? Is there any reason for him to hesitate to tell you why he's being distant? Maybe you could ask him, if you are ready to hear.I'm glad to hear that you believe that you deserve a full, loving relationship, although it seems that moving forward might be difficult for you. Is it possible your happiness is a bit too dependant on this man? I'm just guessing, based on what you've said here.  It seems that it's possible your situation has led to some depression, and I would recommend a session with a qualified therapist to help you sort this out. You will need support, even if the relationship is repaired. Best of luck."], "history": ["I've been hurt by a man for five years. He doesn't involve me with the family or kids. Everyone in the family is against me. There is a Mass today for a family member, and he never asked me to go. I'm to sit home alone now and Christmas too. He expects me to sit alone while he enjoys being with the family. We are in our 50s, and it hurts that he won't even think of me or involve me as part of the family. He doesn't even care. I am leaving him as soon as possible, but I hurt so bad that I didn't know who to turn too. I'm now in this low funk of depression, and I'm scared because I do stupid things to myself and give up. I have no friends because I was a truck driver. I've been getting serious headaches and can't sleep. I don't eat; I've lost my appetite. This has been going on for a couple weeks now."]}, {"candidates": ["How has your husband acted since then? Was he regretful? How did you find out? Did he confess? These are all things that you want to consider. Betrayal is very hard to get over so if it's taking you awhile to get over, know that this is normal.Hopefully you're husband has been very regretful and upfront and honest with you since this happened. It may take awhile to reestablish your trust with him and he should understand this. It's also very important to discuss WHY he cheated. You want to make sure that the reasoning behind this was not something that could arise again in the future. And if it can, there needs to be an action plan in place (i.e. being honest with how he's feeling) so that you both get a chance to rectify the situation.If the cheating has happened more than once, you may want to reevaluate your reasoning for staying in the marriage. It would be obvious that he did not truly regret what he had done or else he wouldn't repeat the same mistake. However, if it was a single event and he has shown you and continuously shows you that he genuinely loves you and is sorry for his mistake, I would give it a try. People do make mistakes and sometimes it takes an event like this to realize what you have.Know that it takes time and that you have the right to feel what you feel. If the relationship was a good, healthy relationship, it is worth saving. Ease back into it and be upfront with your feelings. In return, your husband should be patient and understanding of this. Also, marriage counselors are often a good go-to as they have a great deal of experience working with marriages in similar situations. Best of luck to you!"], "history": ["My husband cheated on me and it hurt me very bad. It was a time when my health was poor. I'm have a hard time moving on."]}, {"candidates": ["There is an organization dedicated to helping individuals find affordable counseling.  It is called Open Path Collective.  There is a one time membership fee of $49 and it lasts for your lifetime.  You then have access to local counselors/therapists who will see you for an extremely reduced rate, anywhere from $30 - $60.   https://openpathcollective.org/"], "history": ["I need to speak to someone about sexual addiction and binge eating immediately."]}, {"candidates": ["There are plenty of online providers within the mental health field that would me more than happy to speak with you immediately.  Many of them provide treatment on a sliding scale fee.  I would google online mental health treatment providers and that should lead you to a list of providers that can help you."], "history": ["I need to speak to someone about sexual addiction and binge eating immediately."]}, {"candidates": ["Depending on your area and location, there may be therapists who provide services on a sliding scale. Additionally, churches will often times offer counseling for free or for a small fee. I suggest doing a simple Google search and contact therapists in your area. It never hurts to ask for a reduced fee and even if he or she is unable to provide the service, they may be able to refer you to someone who can."], "history": ["I need to speak to someone about sexual addiction and binge eating immediately."]}]}]