[
    {
        "personality": [
            "Tell me more about the situation?",
            "Has this happened before in the past?"
        ],
        "utterances": [
            {
                "candidates": [
                    "Watching children go through challenges in their lives is difficult. On a very basic level, There exists a primal need to protect them from harm. The hard part for parents is letting them feel those challenges and working through them as they get older. At some point, there is a moment that occurs when the role as a parent shifts. Children no longer need the basics (food, shelter. water, safety) as much as when they were toddlers, but rather, their needs shift to wanting more support, encouragement, advice, and room to make mistakes. This is where the ability to communicate with them, letting them direct the sails to gather the wind needed to move, is so important. Keep the lines of communication open and be available to give feedback when they ask for it."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Oh dear - this is becoming all too common.  I suggest you have some conversations with your girl to figure out where she is getting the \"information\" that she builds anxiety around.  I see teens  who have heard teachers, parents, coaches, etc push the \"highly selective colleges\" idea on kids way too much.  Teens in particular are prone to black and white thinking, leading them to see one poor test performance, one off day, one not-great assignment as the make-or-break task on the path to successful adulthood.  If that's the case with your daughter, she needs you to help modulate both the incoming information (there are nearly 5000 colleges in the US - she will get into one of them!) as well as her reaction to that information.As well, you and any other adults that are involved in parenting her need to discern fact from fiction.  The recent scandal around celebrities \"buying\" their kids into college is an indicator of how far off track we, as a culture, have gotten in terms of education.  A college education is certainly important, but we have allowed the marketing push to create so much stress and upset for our kids (and ourselves as parents) that they are actually less prepared to leave home and really engage in higher education than ever.You may want to include a therapist in these conversations if you get stuck, but start with a parent-child conversation.  Help her figure out what is going on - if it is the \"I have to get it right or I will have no future\", calmly walk her through all the evidence that says that's just not true.  As well, let her know that being anxious now is NOT preparing her for a bright adulthood - it's preparing her for an anxious future.  She needs help figuring out how to balance her effort to attend to real and reasonable expectations, not over-inflated fear-based actions."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Sometimes stress helps us become motivated and thrive to do better however, if your daughter is stressing to the point that she is crying and freaking out then that would be concerning. Helping your daughter with relaxation techniques like deep breathing or guided imagery would be a good start. Also, reminding your daughter that you see her doing so well in school and that most importantly you are there for her. I would also make an appointment to see a mental health therapist they can have more ideas on ways to de-stress."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "The most important action you can take here is validating her feelings and staying calm when she is crying and \"freaking out\".  It's equally important to do some self exploration regarding your own thoughts, feelings, and behaviors towards making mistakes and how you respond to your mistakes.   When she is calm, ask her what a mistake means to her.  Giving her examples of different kinds of mistakes and listening to her responses will give you an idea of how extreme her thoughts are.  Taking this opportunity to share with her your own struggles with perfectionism or some other area would help her feel more at ease.  Reminding her that she is enough just as she is would be helpful as well.  Encouraging her self care routine will help develop a greater sense of balance regarding her priorities.  The practice of mindfulness will be helpful in self awareness.  Creating a plan on what to do when the early signs of \"freaking out\" surface will strengthen her coping skills.    Your fears as a parent are completely understandable and this definitely needs to be addressed.  Your daughter cannot bring about change on her own and will need the family to work towards this change as well.  A therapist that specializes in anxiety/perfectionism would be a great resource.  They may also help you all have a greater understanding of what the root of this need for perfection is and how it plays a role in the family.  I suggest one or two sessions without your daughter would be helpful to develop a course of action.    I hope this was helpful.   It takes a lot of courage to seek help and guidance, I'm glad you posted."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "I hear your concern that your daughter might break under the pressure and stress that she is dealing with.  It is a good thing that your high achieving daughter is calling out for help and that you are listening.  The education system is wrought with social and emotional problems, and there is a disproportionate emphasis on test taking, scores and achievement in school.   It sounds like your daughter would benefit from some social and emotional education and learning to understand how her feelings are impacting her thoughts and behaviors.  I'd like to also assure you that crying and freaking out is a normal part of growing up.  Depending on your daughter's age, it is likely that she is going through a growth spurt and she may be feeling her feelings in a unique way to her too.  If this is the first time you are having a concern about anxiety then rest at ease and see if you can ride the emotions with her and be a stable sounding board for her.   Use empathy and compassion and allow her a safe place to process through her concerns.  Try not to solve it for her, but allow her a space to fumble through and find her own answers to the problems she is faced with.  Give her confidence that she can figure it out, and be patient as you sit with her.  Our presence is key to our children's well being.   Make eye contact with her, allow her to squirm and get frustrated and work through it while you witness her process.  As parents, when we can model calm in the storm of life our children learn that all of their feelings are ok too.  When our children see and feel our fear, it can create more insecurity and low self evaluation of their own efficacy to manage the stress.  When we can be calm and reassuring, then we can boost their confidence in their own ability to problem solve what they are going through.  Let's face it we all have irrational thinking from time to time, and usually it is when we are under stress.  If your daughter continues to show concerning anxiety, check with her school and see if she can benefit from an opportunity with the social emotional learning curriculum.  In Texas at least, schools are required to have resources for children like your daughter who are experiencing anxiety and other mental health concerns.  Her teacher is with her all day and you may request to have a conference with her to see if she can help her in any way as well.  If resources in your school are limited then I would seek an outside therapist who specializes in working with children your daughter's age.  Call around and see if she can benefit from a therapeutic relationship outside of school and home.  Once you have plenty of feedback from her teacher and a therapist or counselor then you will be able to determine if seeking medical care is necessary with their support and guidance.  Thank you for your courage to reach out for help on behalf of your daughter.  You are her greatest advocate.  I hope that you find support to help you navigate this time in her life and that you both grow and learn from this experience."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Aye, you're correct, that isn't normal, and maybe you should get her to a doctor!Before you do that, and if she were my daughter, I would provide her the necessary physical support that can be given readily at home; that is:  proper natural diet, rest, and a good sense of detoxification before she readies herself to approach it.Basic listening is warranted here and would be of great use."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Your daughter is suffering from extremes of perfectionism. She needs to know that God accepts her as she is. I can provide her with a knowledge of her God-given, inborn temperament to help her find her God-esteem."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "As parents, it's hard not to have \"freak out\" moments when our children are being bullied, stressed, or exhibit other symptoms of teenage angst. We walk a delicate balance of letting go and giving autonomy to our teens get older. Adolescents are learning how to be functional adults and it's important to allow them to try (and sometimes fail) in managing their emotions. Grades are a pretty good indicator of how a student is doing, overall. If your daughter has a 4.0 and there's no pattern of \"crying and freaking out\" I'd offer gentle support and encourage her to find ways to relax when she's stressed. If her grades start to decline and her crying spells become more frequent, a call to a counselor who specializes in teens might be in order. Good luck!"
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "I am sorry to hear about your daughter. Many of the youth I see in my practice are going through similar behaviors and concerns. If she feels like she can talk to you about this I think that is a great place to begin. There are many life stressors that youth have to manage and seeing others on social media seems to exacerbate these feelings and can feel like even more pressure to strive for perfection. You may be able to offer her support by listening to and validating her concerns, reviewing all that she has accomplished and praising her for doing her best and not push that she needs to be \"the best.\"If she feels she would like to speak to someone it may be good to find a therapist where she can vent her feelings and find a way to increase her coping skills. She may benefit from additional support outside the home where she can cry, learn to manage her worries and gain skills to triage the expectations of each day. She may benefit from skills that would help her to learn that she is enough already!"
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Hi there Mom! Just look at all of the things that a teen has to juggle and it's no surprise they're stress out. There are simply not enough minutes in the day to get everything done.  So, they react by cutting into important times such as social interaction and sleep.  Our fast paced, fast food, society is taking its toll on our teen generation. While multi-tasking seems to be a hot pop word, it simply doesn't work.  We aren't wired to do our best at multiple things at once.  We are not machines but rather humans who are going to quickly expire if we don't get a handle on our stress.As adults, it's time we intervene and teach our teens how to maintain a healthy balance between work and play.  We need to help them prioritize and put first things, first.  Are you putting first things, first in your life?  If not, it's a good time to start. Best of luck to you and your daughter in whatever you decide to do."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "I understand that as a mom it must be really hard to see your daughter stressing about things at school. Based on your description it sounds as though she has very high expectations of herself and is pushing herself to keep up. I hear your concern and recommend that to start, you provide her a space where she can express herself openly to you without judgement. Although it may seem as though this is \"not normal\", unfortunately it is. From standardized testing, to awards, to scholarships, the pressure is on to perform at high levels for kids today. Secondly, I would recommend that you connect her with therapist that can teach her coping and stress management skills that can help alleviate some of her anxiety. A therapist can also help her identify any faulty beliefs she may have in regards to perfectionism or fear of failure. You're doing a great job keeping an eye out for your daughter and being in tune with her emotional wellness!"
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "I hear that you are concerned about your daughter's reaction and her emotional well being. Her behaviors are worry some as you feel she seems to be approaching her breaking point. I would suggest speaking to your daughter about the situation at school and her feelings. Listening and acknowledging your daughter's feelings without judgement or giving solutions is a very effective communication skill. Ask your daughter how she feels about speaking to a therapist or her doctor. Someone that she knows and feels comfortable talking to about her feelings and learning healthy coping skills to address stressful situations."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "It sounds to me like your daughter is anxious to be perfect and has a low tolerance for failure.  As her mother one of the most important messages you can share with her is that she need not be perfect, nor is it necessary.  As a matter of fact, failure and making mistakes are only opportunity to learn and grow.  Give her permission and more importantly she needs to give herself permission to be a perfectly flawed human.  It may be a good idea to see a therapist to help her learn how to reframe some of her negative beliefs so she can form healthier thinking habits. Warm wishes."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "children and adolescents who have a desire to achieve high grade point averages often have the symptoms you are describing. It sounds like, your gut is telling you to help her find ways to de-stress. Listen to your gut-always; as her mom, you know her needs better than anyone else. She would probably benefit from seeing a therapist to help her deal with the stress of being a high achiever. I provided the following suggestion to another parent with a similar concern: First identify the three most stressful aspects of the day. Do this by creating a circle on a regular size paper. (do this three times); ask your daughter how much of that circle can she confidently say she has under control. shade that in. The remaining parts of the circle are then named by intensity. (for example, in the circle labeled school anxiety, the client identified that she felt she could handle school anxiety 1 out of 4 days. The circle was split into 1/4. 1/4 of the circle was shaded . the remaining parts were labeled with the challenges that caused the client school anxiety.(these were 1. walking to class during passing time. 2. not having the assignments completed or at all. 3. feeling fat. after labeling each part; and making note of the percentage of the stress associated with each concern, free form thinking takes place and a pile of unwanted behaviors and genetic responses are portrayed  around the circle in bright colors. Using note cards, create a tree of concern; the concerns can be written on note cards. a concern = the behavior that leads to more trouble.  For example, \"all i could do was think about that extra slice of pizza, I was unable to concentrate on the teacher's explanation of the assignment\" (the concern you would write on the note card is Inability to concentrate. Now, fill up the back of the notecard with all of the different factors causing this pattern. nack. ("
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Dear Concern Mom, Sadly, kids nowadays stress a lot about school and compete with one and another.  Determine Career-minded students, tend to be very hard on themselves and can eventually become very anxious about things.  Whereas, it is a good thing to be driven it can break you down too.  Therefore, I recommend that you find your young daughter someone that can help her find ways to cope with her strong desire to doing well in school. Getting ahead of it now before she gets worst is the best thing you could do for her.  Best of luck to you and your daughter.  Sincerely, Mirella~Image and Likeness Counseling"
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Thank you for being an observant parent and taking the very important step toward getting help for you as well as your daughter. The period of adolescence and emerging adulthood are tumultuous times for youth ( and their parents). The pressure to fit-in, be liked, and succeed could be some of the contributing factors for your daughter's stress. I  have had many adolescent clients who do very well academically, but keep it well hidden from their peers so that they can fit in. She is still learning about herself, her abilities and how to like herself none of which are easy tasks even for adults. The academic success that you refer to only tells part of the story. As I read your statement, I got a sense of what your daughter does and that you are proud of her academic accomplishments. However, I would also want to ask her who she is as a person and encourage her to explore that with assistance from a therapist.By working with a therapist your daughter will have the opportunity to discuss her stress, fears, and focus on achievement with an objective person. As she gains a better understanding of the source of her stress and learns some stress management, she can also learn to communicate her concerns to you. I do recommend starting with a therapist rather than the doctor. If the therapist believes that your daughter's symptoms would benefit from a health exam and/or medication they will make that recommendation."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Hello! First of all, thank you for paying attention to your daughter and noticing that she is concerned! It sounds like you have been a positive influence on her for her to be so focused on achievement and for her to care so deeply about her performance! Based on what you've said here, I understand that you are concerned that she is overly stressed, though. I share your concern. People of all ages have meltdowns when they become overwhelmed with stress, and the negative consequences of those meltdowns can definitely have a ripple-effect into other areas of our lives.For your daughter, the thing I would want to know FIRST is this: does she feel she has adequate healthy coping skills to manage the stress she is experiencing? Because, it doesn't really matter WHAT she is stressing on...what matters is how she deals with her stress when it threatens to overwhelm her. I'd like to know what, exactly, that she does when she is feeling stressed that helps her to feel better. If she has only unhealthy coping skills (for example, sleeping, shutting-down, raging, self-attack with critical self-talk, etc.), or only one or two healthy skills, we would want to teach her some additional healthy strategies to help her KNOW that she can cope. Just one risk of not addressing this issue now could be that she may come to \"learn\" that stress is 'unbearable' which may cause her to turn to destructive or escapist strategies to avoid the discomfort, the pain of feeling hopeless, and/or the negative belief that she \"cannot help herself.\"  I definitely think it would be worth both your whiles to have her evaluated by her family doctor and/or a professional counselor. With a counselor specifically, she could learn the needed skills as well as be evaluated for other issues that may be contributing to the issue (for example, a learned belief that she \"must be perfect or she is not worthy.\") Plus, having a neutral support person to help her meet her personal goals is always a good thing. Good luck, mom and daughter!Learn more about me and my practice at www.EMDRheals.com"
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "As a therapist and mother of four children (3 of whom are teenagers)...I hear your pain.  Raising children in our society is no joke.  Kids are under a tremendous amount of pressure from parents, peers, teachers, coaches and the list goes on and on.  Fear and anxiety can suffocate students particularly as they approach their high school years where they are bombarded with questions about their future and expected to select professions before they have even gone to college!!  I highly encourage the teens I work with to strive for balance in their lives- and we can model this for our children by how we choose to live!  Encourage your child to spend time with friends, join you for a yoga class, read a book, pick up a hobby or go out to exercise.  If your daughter continues to feel overwhelmed by stress, it would be a good idea to select a therapist for her to go speak with.  As much as we love our children, there are times where kids need to consult with a neutral 3rd party.  It can be a wonderful thing for kids to have a therapist whom they can confide in."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "As a  Parent it can be very hard to see your child struggling. It sounds like they’re experiencing anxiety from their stress. It’s always a good idea to check in with your family doctor. Many children are experiencing anxiety and can benefit from individual counseling services to help them cope with their stress. School pressures and academic achievements  can you create physical stress responses in the body. Seeing a counselor can also help you as the mom or dad have available tools to provide Continued support. It sounds like you are a great support for them and helping them connect to their resources."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "It sounds as though your daughter is struggling to manage her anxiety and she is having really big reactions to what you view as small problems or issues. What have you tried with her in the past? As exhausting as it might be, a good first step is to empathize and validate her feelings."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "It may be helpful to register for a class you can take together. I would recommend mindful meditation or yoga, just the two of you. Something you find time for in a weekly basis. Yoga is amazing in learning mindfulness and reducing stress. I use yoga and mindful techniques when working with children and recommend it to parents to engage with their children. Hope this helps."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "Its hard to answer this question based on the information presented but I shall give it a go, Is it possible that your daughter is afraid of failing, I've seen many children and kids who get stressed out over grades or performance in sports, can you tell me \"what was your grade in fourth grade English? Or what was the score of the 7th game you played in football when you were a junior? Much of what happens to us is insignificant and we worry over things which really , in the long term don't matter much to us. But ask yourself this question, Is your daughters reaction to what is going grossly out of proportion with what would normally be expected, if the answer is yes, a visit to a psychotherapist might not be a bad idea to learn some coping skills and to alter our reaction to life."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "I agree with your observation about your daughter feeling stressed.  Are you able to open this topic in conversation with her?Also, reflect on your own expectations as a parent.  It is possible that your daughter is trying to please you by getting consistently high grades.If your daughter prefers talking in confidence to a therapist, then this may help her regain a sense of balance in her life so that schoolwork feels less stressful.I wouldn't take her to a doctor because based on what you write, the problem is psychological and emotionally based.  While the stress may have physical symptoms, addressing the root cause of the problem has nothing to do directly with something being physically wrong with your daughter.Unless there is some other medical or physical problem that would explain your daughter's sense of stress,  I'd start first by bringing your areas of concern to your daughter, then possibly to a therapist."
                ],
                "history": [
                    "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal."
                ]
            },
            {
                "candidates": [
                    "I imagine you are trying to figure out a way to be \"fair\" to your adult kids.  The key word is \"adult\".  If your daughter can afford to join the family for a vacation that's great, she's welcome to come.  However, as you pointed out she took a vacation by herself last year - she chose to put her resources (time off work and money) into doing that.  Good for her - she did what she wanted.  If she wants to budget time and money for a family vacation she will.As for feeling guilty, let me echo the sentiments already offered - vacations are lovely, but not a survival need.  Your girl is in her 20s and it's her turn to provide for herself.  You did your parenting - now go enjoy your vacation with whoever can, and wants to, join you!"
                ],
                "history": [
                    "I have four children. One of them is in her 20s, and she cannot afford to go, nor can I pay for her. She went last year for two weeks by herself."
                ]
            },
            {
                "candidates": [
                    "Of what do you feel you'd be guilty?Family vacations are not a basic human right to existence.  They are fun, ideally.  You're not violating a basic human right.  You wrote that you don't have enough money to pay for her to come along.You may find yourself feeling more guilty toward yourself if you give more than you reasonably can afford to give.My suggestion is to tell your daughter your reason for not taking her along. Maybe this will open more dialogue between the two of you."
                ],
                "history": [
                    "I have four children. One of them is in her 20s, and she cannot afford to go, nor can I pay for her. She went last year for two weeks by herself."
                ]
            },
            {
                "candidates": [
                    "All you can do/control is work on yourself. When you have enough sense of self, you will know how to deal with your family. Therapy is an investment in yourself, which affects your family."
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "Hello, I am sorry to hear about you feeling verbally abused, trapped without an escape, and emotionally drained. Sounds to me like you are being treated more like a child than an adult.  It's time to learn about healthy boundaries and being treated like an adult. This process will take time, but beyond elevating your self-esteem and worth, you will be modeling to your children a healthy adult. Model to them an empowered, confident, and person that is worthy of respect. Please invest in yourself. Find yourself a therapist that encourages and empowers you to have a voice and not feel invisible. You'll be so glad you did!"
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "I am so sorry this is happening to you.  One thought I have is for you to create a mantra or a soothing statement to say over and over to yourself as you are being bombarded with this negativity and abuse.  For example you could say \"Living here is temporarily, one day I will have my own place\".  Or you could say something like \"I am a good person, I am a good parent, and I always try to do the best I can\".  Saying this over and over to yourself as you are listening to your parents will help you to tune out some of their words but it will also start to build more positive neural connections and start to wire your brain to build and/or strengthen your self esteem.  Focus on the temporary nature of your situation, start making plans for leaving the situation.  If you are under 18 and can't leave because you are in school, now is a good time to start planning for when you can leave.  That when when the opportunity is available you know how you will get a job, how you will find an apartment, who will provide daycare.   This will make the transition out of your parents home much easier and it will give you something to look forward to while you are in their home.  Take care!"
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "Your situation is a difficult one, but I would encourage you to start considering how to set boundaries for yourself and your family members. Often, times we believe we have to allow a certain behavior because a person is family. This is not true. It sounds like you could use some help understanding finding your voice and asserting yourself with your family members."
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "I am so sorry you are experiencing this situation.  Considering that you mentioned not having a place to go, it may be best to address the problem as oppose to “just take all of it”. Confrontation can be done in a healthy and effective way.  Being able to communicate your feelings with the intent of improving the problem can be a great skill needed in multiple settings in life.  The therapy process can help build this skill set and goal plan to remove yourself from the home.  Good luck."
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "The first step is realizing your value and establishing firm boundaries. When your parents cross that boundary and are verbally abusive, you have to have a plan to stand your ground and act upon it. That plan may include a better job to afford a place of your own, a domestic violence shelter if you are unable to provide for your needs, a firm talk with your parents about your parental authority, or other. Whatever you do has to be firm or consistent, a boundary that you allow someone to cross is no boundary. There is always a way, if you have no where to go, ask yourself why is that the case(which I am sure you have considered already) and what can I do about it. If you choose not to take any action then you are enabling your parents to remain abusive. Ask yourself too, why am I not acting on my situation. Am I too dependent on them? Do I not want to change? Is it easier just to let them provide for me? Be honest with yourself. You need to work on your self esteem, and things that empower you. Support groups in person or online, Church groups or organizations, friends, books, music, etc.... but think on things that will empower you. Are you stuck financially because of the need for a job? Do you need to go back to school? Do you need training in a new field? There are a myriad of possibilities and answers. Action, think action and Change, what can I change?"
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "I can't imagine what you are feeling but I can tell you that you are right to be concerned about your children baring witness to this abuse.  This is a great teachable moment for your kids.  How you handle yourself will be very important for your children to see.  Your \"REACTION\" is what you should focus on.  Will you react with rage and name calling? Will you listen to your parents with respect and talk to them in private about how they are speaking to you in front of your kids?  Will you talk your kids about what is going? From reading this I am assuming you live with your parents.  If this is the case you have to think about what you can do to change your situation.  Have a plan! Set a goal!  Don't lose hope!"
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "I think one of the best things to pass on to our children, or simply one of the best lessons in life, is to learn when to internalize (it's an issue in me) and when to externalize (it's an issue in them), as well as always finding the balance of the two.In this case, you don't seem to be the issue. Sure, living with your parents with your child probably is not your dream scenario, nor your parents'. But, there are ways to process that without someone feeling abused, and your parents clearly have zero ability or boundaries if they are willing to verbally abuse you in front of your child, and their grandchild. If there is a reason they are doing so, I'm sure they think they have a good one. However, the dynamic that they are willingly setting up is problematic. And it is THEIR problem. However, by being strong and not taking in someone's verbal abuse, you are going to role model for your child how it's about what is inside of you, your own drive, that will be what is important, NOT what others say about you. It's important to always come back to yourself inside, and seeing the good that is in you (or even just noticing that it's there, if you can't quite see it in its entirety.)I would also advise your parents to think about their own role modeling."
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "When their verbal abuse starts, tell them you are exiting the conversation because the way they're talking to you is unacceptable.Explain you are willing to hear their point of view only not when it is expressed as abuse.They may not agree with your opinion and also may not want to change.Even if they do not change, you are entitled to be treated as a human being who is worthy of respect.Explain your reason to exit the conversation and ask them to write down their requests for you to consider."
                ],
                "history": [
                    "I'm being verbally abused on a daily basis by my parents in front of my child. I feel like I’m trapped and I have no escape. I feel like I have to listen to the horrible things they say and just take all of it.\n   I need some way of learning how to cope with listening to it especially since I have nowhere else to go. I feel very emotionally drained How can I deal with this?"
                ]
            },
            {
                "candidates": [
                    "This sounds frightening and overwhelming, and I’m glad you are reaching out for help. I can’t say for sure your children are being abused but I can understand your  suspicion since there appears to be a change your children’s behavior. I think it would be important for you to keep an eye on the situation Incase you notice any other changes. If you become more concerned, even  suspicions of child abuse are reportable to  Family protective services. If they feel it is necessary they can do an  investigation. You are doing the biggest thing for your children by being there for them and supporting them."
                ],
                "history": [
                    "When they come home from their dad's and I fuss at them for anything, they move like they are dodging being hit. They say they’re sorry over and over really fast. I ask and they say no one has hit them, and I've seen no marks. Am I being paranoid or am I right to be?"
                ]
            },
            {
                "candidates": [
                    "It sounds like your children are walking on eggshells, and behaving in a manner that suggests that (at minimum) they may be receiving an undue amount of anger from someone in their lives. In addition to addressing this delicately with your children's father, it would be wise to speak with your children's teachers and pediatrician as well. Please closely  monitor the situation, and express to your children that they can always come to you with any information, and they will never be in trouble for confiding in you."
                ],
                "history": [
                    "When they come home from their dad's and I fuss at them for anything, they move like they are dodging being hit. They say they’re sorry over and over really fast. I ask and they say no one has hit them, and I've seen no marks. Am I being paranoid or am I right to be?"
                ]
            },
            {
                "candidates": [
                    "The short answer to your question is \"No\" it's not okay for anyone to ever be doing this. There's a lot of unanswered questions and other factors going on here that need attention. Nevertheless, don't hesitate to seek out legal counsel and/or call 911.    Ideally, your fiancé would be able to speak directly to her ex-husband and set reasonable boundaries that honor whatever legal agreements are in force resultant from the divorce and custody agreements. The fact that she's afraid to say anything to him about his inappropriate behavior, and that she hasn't been able to give you any reason for her fear, suggests possible factors of past abusive behaviors, entitlement, and/or co-dependence.   I hope things work out well for all and I'm confident a skilled therapist could help all navigate how best to set boundaries and experience greater healing."
                ],
                "history": [
                    "he just walks in the house whenever he wants to see his kids. My fiancé tells me it makes her angry and doesn't like it, but she seems afraid to say anything to him about it for some reason. Is it okay for him to do this?"
                ]
            },
            {
                "candidates": [
                    "The kids are actually her Property, and he does have a claim to them as he wishes;The house is yours, I presume;So require that if he wishes to see his Property, it be done off of your Property;And, that as long as it remains your Property, you have jurisdiction over all those, therein;Require compensation for visits, and send him a bill;When he doesn't pay, send to the local sheriff, go to small claims court, and win a judgment against him for non-payment;I wonder how that might work out... act as man :)"
                ],
                "history": [
                    "he just walks in the house whenever he wants to see his kids. My fiancé tells me it makes her angry and doesn't like it, but she seems afraid to say anything to him about it for some reason. Is it okay for him to do this?"
                ]
            },
            {
                "candidates": [
                    "The obvious answer is no, it's not okay.  There are other you should be asking though.  You said your fiance \"seems afraid\" of her ex.  Did you ask her about that?  Is there a reason he still has a key to the  home?  Has there been any discussion of appropriate boundaries?  I work with a lot of people parenting from different households and the stickiest spots are the ones that have not been discussed.  There is obviously conflict there or they wouldn't have split, but your fiance and her ex do need to stay aligned for the kids and that can't happen if she feels fearful or resentful.  If she doesn't have a problem with his barging in, clearly you do (and who wouldn't?  He's not YOUR ex!), so you and she need to have some agreements around his access to the home.  If she is afraid to bring up the discussion then I strongly recommend that she and the ex get some help with a good therapist.  The kids health, your health and hers, and the health of your relationships in the family depend on it!"
                ],
                "history": [
                    "he just walks in the house whenever he wants to see his kids. My fiancé tells me it makes her angry and doesn't like it, but she seems afraid to say anything to him about it for some reason. Is it okay for him to do this?"
                ]
            },
            {
                "candidates": [
                    "Do you know the reason your fiancé puts up with the ex's behavior?If not, then ask her.The answer could be anything, from some agreement the two of them made either formally or informally before you came into her life, to residual sense of obligation she feels toward him as a parent, or that she genuinely does fear his physical or verbal anger if she disagrees with what he wants.Facts are the best starting point to know how to handle a situation.There is no blanket rule and certainly no law which prohibits what he's doing.   The situation is entirely in the hands of the people involved."
                ],
                "history": [
                    "he just walks in the house whenever he wants to see his kids. My fiancé tells me it makes her angry and doesn't like it, but she seems afraid to say anything to him about it for some reason. Is it okay for him to do this?"
                ]
            },
            {
                "candidates": [
                    "Depending on your daughter’s age, this could be a learning disability.  I suggest contacting the school counselor and asking for an evaluation, once she is evaluated and depending on the diagnosis, she could be provided with treatment recommendations like occupational therapy, reading glasses, or assistance in class. These and more accommodations are enforced under the 504 act. Consider if the observations that you have done are affecting her performance in school only, or also in other settings.  Observe her behavior and or her emotions and see if they change as well.  Discuss these with your daughter’s counselor as well.¿Tiene mi hija un desorden mental?Mi hija está en la escuela elemental.  Ella no puede colorear dentro de la línea.  Mezcla las palabras cuando escribe, a menos que tenga grandes espacios, o brinca las líneas.Dependiendo de la edad de tu hija esto puede ser un problema de aprendizaje.  Te sugiero que contactes al consejero escolar y solicites una evaluación, dependiendo de la diagnosis, ellos pueden recomendar tratamientos como: terapia ocupacional, lentes para leer o asistencia en clase.   Estos acomodos son provistos bajo la acta 504.  Considera si las observaciones que has hecho afectan el desempeño de tu hija en la escuela, o en otras áreas, también observa su conducta y emociones y repórtaselo al consejero escolar."
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "At times when a child is not displaying milestone behavior at the same rate that is average for their peers, this should raise concern, so you are correct in reaching out for advice. Speaking with your child's pediatrician, as well as school staff may be the first places to start. You can request that she receive an assessment and evaluation, with a subsequent treatment plan to meet any needs she may have."
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "Kids develop in different ways and different speeds. It can sometimes feel like your kid has a delay because of these different ways of development. If you have concerns about your child’s development then addressing it with the school is the best solution. They will be able to provide a full assessment if needed with an academic diagnosis as well as academic support."
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "Contact your daughter’s school and ask for an occupational therapy evaluation. An occupational therapist can determine if your daughter struggles with eye-hand coordination, visual processing or sensory motor difficulties. The therapist will develop a plan of care if your daughter demonstrates delays or difficulties in learning. OTontheGo.org mobile therapy that comes to you! Accepting most insurance."
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "Developmentally, there are ages where not coloring in the lines, writing words that are jumbled together, and leaving big spaces or skipping lines are completely normal.  I have seen children in 3rd and in some cases, 4th grade who do not have learning disabilities write in the manner you have described.  There is, however, a type of learning disability called Dysgraphia which can present in the ways you have described. If you suspect that your daughter might have Dysgraphia, then the best thing to do is to have educational testing done.  You can request testing by going through your school system and asking for an IEP (Individualized Educational Plan) meeting.  Your school is required to honor your request for an IEP meeting.  At the meeting, you can ask the school to do educational testing that will be at no cost to you.  I will say that depending on where you live and your school system, it can sometimes be difficult to get the school system to do testing.  If that is the case, you can go to a psychologist or find an agency near you that can also perform this type of testing as well (some will accept insurance and others will not.)  There are also educational advocates that you can hire to help you if you ever have difficulty getting your daughter properly assessed by the school system.  I also highly recommend seeing a developmental ophthalmologist and/or a developmental pediatrician.  They can be great resources in helping you to determine if your daughter does have a learning disability.I always say that a parent should \"trust their gut\" and if you feel that your child is struggling and that there may be a learning disability then there is no harm in getting your child evaluated.  The best case scenario is that your child is completely on track and what you are seeing is developmentally appropriate.  On the other hand, if your child does have a learning disability, then you have caught it early enough where she can receive services that will help her in the long run. Either way, it is a win, win."
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "It sounds like it might be worth asking the school for an evaluation to determine whether your daughter has any learning disabilities such as dysgraphia or dyslexia or seek an evaluation through an educational neuropsychologist.  I would also suggest having her vision checked by a developmental optometrist."
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "If your daughter is the same age as most of the other students in her class, and the other students easily complete the tasks you list here, then there is a problem in the performance of these tasks for your daughter.Without knowing more about the context of your daughter's life, for example, is she a new student to the school and class, are there major stressors in the home environment, does your daughter have friends, does your daughter have the same problems she has in school, when she is in other environments?Also, who is telling you she has these problems?  Are you the one who notices what you describe here or is your daughter or is her teacher telling you these facts?Depending on your answers to the questions, start to get clarity with the classroom teacher and the school guidance counselor as to the source of your daughter's problem.Good luck!"
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "There could be a number of things going on here. For instance, have her eyes been checked by an optometrist? She might just not like writing or coloring. She could be rushing through assignments so that she can spend time with friends, play games, or do something else. She might need some extra help with fine motor skills. What are her grades like? Does she rush through other things like cleaning her room or getting ready for bed?"
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "It's hard to tell from the information that you were able to provide here, but talk with her elementary school a guidance counselor. Someone working with the school (usually a school psychologist) should be able to evaluate her to see if she needs extra help and to tell you more clearly what may be happening."
                ],
                "history": [
                    "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines."
                ]
            },
            {
                "candidates": [
                    "This is certainly an important issue to look into, It is always helpful to speak with the child's pediatrician since they are most familiar with the child's developmental history. Also, children tend to regress behaviorally when facing events and interactions they feel to have no control over, this can be as simple as a loss of a pet, a recent move, death in the family,  and/or as serious as sexual abuse, and other things. If you have not spoken to the school that can be a good starting point."
                ],
                "history": [
                    "My daughter seemed to be developing at a normal rate until about the age of 10. She then started to act younger than she is.    Now she only wants to play with younger kids and she doesn't act her age. I don't know why this is happening. Is this normal?"
                ]
            },
            {
                "candidates": [
                    "Your daughter is fortunate to have an observant parent, who is willing to seek out help in this regard. Regression can be indicative of some stress in your child's life, so the issues she is facing should be examined. Seeking advice from your daughter's pediatrician, as well as a practitioner familiar with adolescent issues or perhaps play therapy can equip you with insight into the causes of the behavior, and give you tools to assist your daughter in learning age appropriate social interactions."
                ],
                "history": [
                    "My daughter seemed to be developing at a normal rate until about the age of 10. She then started to act younger than she is.    Now she only wants to play with younger kids and she doesn't act her age. I don't know why this is happening. Is this normal?"
                ]
            },
            {
                "candidates": [
                    "Hello.It sounds like you are really concerned about your daughter because you have noticed a significant change in her behavior .   It's really a great first step that you are reaching out to get some ideas about what might be going on .  You are clearly an observant and hands on  mom who wants to be sure that her daughter is ok.This is a tough question to answer without more information .  With that said , I have found that \"under stress people regress.\"  In other words , many people , children and adults alike , often regress and behave differently - as if they were younger than their actual age - when under stress .   Therefore , my first question would be : has anything been happening recently that is causing your daughter stress ?  This could be anything from conflict at home , recent changes such as moving , divorce , a loss of some kind , switching schools , or losing a friend or friends .   Additionally , sometimes if children are feeling bullied or left out by same age peers , they may gravitate toward younger playmates as a way to boost their social confidence .    I would suggest that you think about what stressors / changes may have occurred recently.  You may also want to check in with her teacher (s) to see if they have noticed any changes in your daughter's behavior at school .I also think that you can have a conversation with your daughter in order to see if you can get a sense about whether or not something has been bothering her.  Something as simple as \" I have noticed that you aren't spending time with the friends you used to hang out with ; it seems like you have been playing with a lot of younger kids lately .  Am I right about that ? \" and then if she says yes you might ask a few questions such as : \"did something happen with your friends that  is making you not want to be with them?\" \"Has something been bothering you lately ? Are you feeling upset or worried ? \" If she denies that there is anything wrong you might even say \" I know that sometimes when I feel stressed or worried , I tend to act a little differently - sometimes I withdraw from my regular group of friends , or I get cranky and feel less like myself .  I wonder if something like that is happening with you ?\" If you are really concerned and not getting any answers from her and / or her teachers , perhaps you can consult with a therapist to discuss your concerns further and decide if it might  help for your daughter to talk to a therapist a few times , or at the very least you can get more specific tips from a therapist about how to approach this issue with your daughter more effectively . The more detail you can provide about what you have noticed with your daughter , including any changes or new stressors ,  any possible patterns to this behavior , if school has become more difficult socially and or academically , the more a therapist can guide you about how best to handle your concerns and talk with your daughter in a way that is helpful to her. Good luck!   I believe that this may just be a phase and it seems to me to be well within the normal range of children's behavior.  I do, though, think that you will feel more assured about this  if you can get to the bottom of what's going on ."
                ],
                "history": [
                    "My daughter seemed to be developing at a normal rate until about the age of 10. She then started to act younger than she is.    Now she only wants to play with younger kids and she doesn't act her age. I don't know why this is happening. Is this normal?"
                ]
            },
            {
                "candidates": [
                    "Good for you to know your daughter's friendship circles and to notice when these have changed.While friendships are key relationships, they are not the only indicator of someone not developing normally.Is your observation and opinion that your daughter isn't normal based on other factors or just this one?If this is the only factor then start with reflecting on what circumstances may be influencing your daughter to socialize with younger kids.Has she ben ostracized or bullied by her peers and may be retreating to avoid further emotional hurt?Is she keeping up with her school work?Sometimes kids who feel overwhelmed by schoolwork will regress into conditions in which they feel more success and control.Are there family circumstances such as the death of someone with whom your daughter felt close?  Or, is there a new younger sibling in the family or a younger sibling who due to their own circumstance receives more attention than your daughter may wish for herself.Once you've reflected on which areas may be affecting your daughter, gently ask her some questions about her comfort with what you theorize may be the source of the problem.Its also possible that offering her your extra time and interest may increase her sense of self so that she feels secure enough to increase her social time with her age group."
                ],
                "history": [
                    "My daughter seemed to be developing at a normal rate until about the age of 10. She then started to act younger than she is.    Now she only wants to play with younger kids and she doesn't act her age. I don't know why this is happening. Is this normal?"
                ]
            },
            {
                "candidates": [
                    "You can \"move on and not live in the past\" in the context of your ex-relationship, but that does not mean moving on from your child. \"Moving on\" then would involve accepting the end of the relationship and developing a civil relationship with your ex-partner as far as is possible for the sake of your child's development.Generally, it's good for a functional (non-abusive) parent to spend time with his/her child, but only insofar as that doesn't cause your child unnecessary stress. That requires the two adults to act like adults with each other for the sake of their child.What's confusing for children is seeing their parents act uncivilly or manipulatively. Children also do well with routines so regular dependable visitation is preferable to random visitation or, worse, not following through on commitments.But if one person is exploiting their child to harm their ex-partner, then visiting your child in that context may be stressful to him/her (depending on what you mean by using your child as a pawn). When dealing with a hostile ex-partner, your first challenge is to negotiate rules and boundaries with your ex-partner about appropriate behavior for the good of your child. If you cannot come to an agreement, a counselor can help mediate a conversation. If that's not an option, then it may be possible to turn to family court to stipulate visitation rules (for which you'd have to consult with an attorney)."
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "Your child is not part of your past, he or she is part of your present and future. Your child needs you. Statistics about fatherless children are staggering. Research shows children raised in a father-absent  home experience the following: 4x greater risk of poverty, more likely to have behavioral problems, 7x more likely to become pregnant as a teen, more likely to face abuse and neglect, more likely to abuse drugs and alcohol, 2x more likely to suffer obesity, 2x more likely to drop out of school, more likely to commit crime and more likely to go to prison. Listen to your heart and ask yourself, what do you want for your child? Co-parenting is hard when each parent is unable to prioritize the best interests of the child. You and your ex-wife can get help learning how to co-parent in a way that will work for each of you with the best interest of your child in mind. What is confusing for a child is why did my parent abandon me and they will struggle with issues of worthiness and self-esteem for the rest of their lives. Here are some websites for you to check out and get help with the most important job you'll ever have...being a father!https://fatherhoodfactor.com/us-fatherless-statistics/https://www.fatherhood.org/fatherhood-data-statisticshttps://thefatherlessgeneration.wordpress.com/statistics/http://fathers.com/statistics-and-research/the-consequences-of-fatherlessness/"
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "Hi, your situation sounds very complicated and sensitive.  It is important to handle it with care as it involves your children.  When parents are attempting to co-parent, the clearer the boundaries and expectations are the easier it gets to effectively co-parent.  Parenting your child is not “living in the past”, allow me to reframe that approach and instead view it as an investment in your future.  Your child will forever be your child and deserves and active loving and caring father.  Staying away sends a different message to your child and leaves room for resentment.  Find a way to create an agreement between you and your ex-wife with the best interest of your child as the focus.  The courts are able to assist with this goal as well."
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "The thing that confuses a child the most is for a parent to come and go from their life. Children have a way of making things their fault, even when they have done nothing wrong. Because of this, when parents cut off contact, the child thinks it's their fault. As hard as that already is for a child, it is even worse when a parent pops in and out of their life. This makes the belief even more strong for them. They start to think, \"why does dad keep leaving? What am I doing to keep making him go away?\"I believe a child needs both parents in their life. Whether she used you for a child or not, that child still exists and never asked for this. They didn't ask to be born into drama and two parents that can't make things work. You can move on and start over while still maintaining a relationship with your child. If you start over far away, this may mean less visits but you'll still be a part of their life. Just make sure when you make a commitment to this child to stick to it. Every child deserves that much. Good luck to you! :-)"
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "What are the ways your ex-wife uses your child as a pawn?This answer determines the best ways to handle particular situations.Basically, distinguish that your father relationship to your child lasts has great meaning for your child and as the adult, the responsibility for managing this relationship falls on you.Your relationship to your ex wife took place between two adults and therefore you are only responsible for your own actions to repair the damage done to you.From what you write, you already have a plan in progress to do this by separating yourself as much as possible from contact with the ex.In a way the challenge of keeping active as a parent while also distancing and clearing your emotions of the hurt and betrayal done to you, will establish both a solid relationship with your child and grow more acceptance and self-forgiveness of having been taken advantage of and tricked."
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "I am really glad you reached out. When parents get divorced, they still need to figure out how to have relationship so that they can parent their child. We might divorce our partners, however, we don't divorce our children. If anything our children need to know that we are still a stable force in their lives. Unfortunately, in some relationships children get used as a bargaining piece and I am hearing that may be happening in your relationship. You can move on from the relationship with your ex while still maintaining a relationship with your child. It is possible and it takes both parents to agree to do the right thing by their child. It is important for your children to have some consistency in his or her time with you. For example, if you and your ex don't have a parenting schedule it is something that you want to create so that you can not only decide for you when you will see your child, but your child can know when you will be available just for her. This will lay the foundation for consistency and allow your child to have some security in troubled times.I would highly recommend you sit down with your ex and discuss how you can both be a positive source in your child's life. How you can both be there to help raise her. If this is not a conversation that you can have on your own you might seek out help from the court. There are parenting experts and mediators who might be able to assist you.Remember, in any discussion keep the focus on what is best for your child and you will be moving in the right direction.Best of luck to you!"
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "If you have a good relationship with your child then you have already accepted and been accepted as this child's parent and you have a commitment and an obligation to play that role.  If you suddenly absent yourself from this child's life then you may be doing real damage. Working out an arrangement with the child's mother for regular visits the child can count on and committed to by both parents will serve the best interest of the child, which I assume is what both parents are truly concerned with.  The visits don't have to be every day, once a week, even once a month, is better than hit and miss with long absences in between.  Best of luck to you, and the fact that you asked the question says volumes about your parenting potential.  Feel free to follow up with me, on line or in person."
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "You're in a difficult situation and on behalf of you and your child, I commend you for trying to find the right thing to do.Short version: your child needs you as much as possible. period. Always. We used to think that children were almost always harmed by divorce, unless there was extreme conflict or violence. More recent data shows that children are not necessarily harmed by divorce if they keep both their parents. In other words, the damaging part is losing half of themselves and losing the value of being connected to everyone who loves them, especially the other parent, in addition to the extra benefit there is from the other parent's perspective, strengths and so on. The best thing for your child is for you to be available and loving and doing everything possible to allow the child to be whole - a person who incorporates BOTH parents. It's a tragedy for everyone to use a child to achieve adult aims, like getting back at a former spouse. In such a circumstance, your child needs you more than ever. If you and your wife have different rules and so on, your child will learn to adjust and adapt, just as they would if you remained in the household. A child quickly learns that they talk to mom about x,y,z or get away with whatever, but has different rules with dad. He/she will not be too confused in the long run. Please stay the course in dealing with a difficult ex-wife for you and your child's wellbeing. Best of luck to all."
                ],
                "history": [
                    "My ex-wife married and used me to have a child. She now uses that child as a pawn. I know my child misses me, but I need to move on and not live in the past. How do I do this? Do I see my child as much as possible or very little? Is it more confusing for the child?"
                ]
            },
            {
                "candidates": [
                    "Behavioral interaction with someone who has severe autism requires highly specialized training, both for any professional staff involved with the person and for the family members.It is an unfair situation for both the person who has autism as well as the campers who do not, to expect both sides to get along harmoniously.In order to achieve this, the campers would need specialized training to know how to respond to distress in the camper who has autism.This would obviously stretch and burden the summer camp budget as well as provide an activity which usually isn't part of summer camp for children.What you can do which may be productive in helping the camper who has autism, is to point out the interaction difficulty to the summer administrators.Ultimately it is their problem to only take campers who are able to reasonably adjust to socializing together and from what you write, the administration has overreached whom they consider reasonable camper mates."
                ],
                "history": [
                    "I am a counselor at day camp where we have a child with severe autism. We try to keep him entertained by carrying cards around for when he starts acting up so we can get him to focus on something else. The day camp administrator has told us not to yell at him because he will zone out and not listen, so we just talk in a calm voice. However, other kids see the treatment as unfair."
                ]
            },
            {
                "candidates": [
                    "Probably the best way to be supportive of your son is to tell him what bothers you about the way he's handling himself.If you'd like him to work with your suggestions then before you make critical comments be sure to validate his strong points and to recognize his natural talents.People are much more likely to take advice if the person feels the criticism is spoken by someone who respects them and isn't only critical of them.Offer your availability to talk with him if you genuinely feel available to speak with him in a non-judgmental way."
                ],
                "history": [
                    "When my son was a teenager, we sent him to live with his dad because of the constant disrespectful attitude. A week after he graduated, his dad made him leave because of the same issues. All four parents tried to talk to him, and he just refuses help all around. He is now living with his grandparents. He had a job, and took steps to get his license and an insured vehicle. I thought he was heading down the right road, and then he tells me he quit his job because he didn’t like it. I just don’t know what to do."
                ]
            },
            {
                "candidates": [
                    "I admire your efforts. You can continue to offer assistance for your son, but it is ultimately up to him to decide what to do with the information or ideas that you are giving to him.One thing you might try is to ask questions in a way that enables you to learn more about what he is experiencing. For example, if he is willing to talk to you about what he does on a daily basis and/or what he would like to be doing, you may be able to get a sense of what he finds difficult and find some resources to help.I might ask things like this (just as examples):Can we talk for a few minutes about some things that I would like to learn more about?I'm just looking to learn more about what has been happening for you recently and I'm not trying to make you do anything.I know you said you quit your job because you didn't like it. Could you tell me more about what you liked and what you didn't like?Do you see yourself doing the same kind of job in the future?What is it that makes you happy or what is it that you look forward to doing?Can you think of anything that I can do to be of support to you?If he is interested, you may be able to connect him with an area community college to learn more about possible job opportunities.With the way that I wrote the questions above, it probably sounds like it's relatively easy. In reality, it may not be an easy conversation and your son may choose not to discuss it with you. If that's the case, I'd remind yourself that you are trying to do everything you can."
                ],
                "history": [
                    "When my son was a teenager, we sent him to live with his dad because of the constant disrespectful attitude. A week after he graduated, his dad made him leave because of the same issues. All four parents tried to talk to him, and he just refuses help all around. He is now living with his grandparents. He had a job, and took steps to get his license and an insured vehicle. I thought he was heading down the right road, and then he tells me he quit his job because he didn’t like it. I just don’t know what to do."
                ]
            },
            {
                "candidates": [
                    "You felt bad when you lied, so you told the truth.  I imagine your mom was really shocked and upset - both of those things tell me you are a pretty honest person.  It's possible that your mom had a big reaction simply because she has learned that her child, from whom she always assumed honesty, was capable of being dishonest.  That's not awesome, but it's not the end of the world.  You made a mistake - you'll make more of those in your life, just try not to make the same ones over and over again.It sounds like you and your mom are close so I can see why it would feel so awful to have her distrust you.  Since you are a fundamentally honest person, the way back to being trusted is going to be simple, but may take a little time.  The \"recipe\" is easy - say what you are doing/going to do; do only that unless change is necessary, in which case you inform others involved, and repeat.  And cut yourself some slack.  Your mom will recover and so will you.  It's an important and painful lesson about integrity, but once learned it will serve you well."
                ],
                "history": [
                    "She cried because she lost all trust in me. Now I feel disgusting and like my heart just got stabbed, what do I do?"
                ]
            },
            {
                "candidates": [
                    "It sounds like you've already learned that just being honest is often the best approach. What do you think about telling your mom how you're feeling?  She might really appreciate it if you also let her know that regaining her trust is really important to you."
                ],
                "history": [
                    "She cried because she lost all trust in me. Now I feel disgusting and like my heart just got stabbed, what do I do?"
                ]
            },
            {
                "candidates": [
                    "Hey! Sounds like the part of you that knows the RIGHT thing to do won here! I am so proud of you for admitting that you lied to your Mom! Sometimes lies come out of our mouths before we can even catch them because we are trying to say what the other person wants to hear. I bet that, as you begin to show her that you are not going to lie any more, she will begin to gain trust in you again! Be open with your feelings with you Mom - she is there to support you, guide you and love you! Give her lots of hugs - and give yourself one too for being so brave! Be Wise!"
                ],
                "history": [
                    "She cried because she lost all trust in me. Now I feel disgusting and like my heart just got stabbed, what do I do?"
                ]
            },
            {
                "candidates": [
                    "That sounds awful, and is clearly unsustainable.  There are some great answers that give some guidance about what might be an underlying condition.  If all physical and mental health issues are ruled out, it's time to take action.  Get backup from friends or family members if you need to, but let your daughter know you are giving her 30 days notice.  She needs to find another place to live within that time.  If she wants to stay with you, be clear that first she has to go, with a potential to return after she has been out for a good chunk of time.  Once out, she can prove to you, and more importantly to herself, that she is capable of maintaining her health and her environment.  Remember, you are going to rule out issues that would make it impossible for her to be successful; if she is in good health, her staying with you and living this way is actually harming her."
                ],
                "history": [
                    "There is just no communication at all between us. She sleeps constantly all day (not at night). She acts angry and unfocused and stays in her very messy room all the time. The only time she comes out is to eat.    She has aches and fatigue, weight gain, hair loss and skin problems. She does not look after her health.\n   I don't know how to communicate with her. She is not open to any suggestions. How do I get through to her?"
                ]
            },
            {
                "candidates": [
                    "Hello, I know that your situation is frustrating and debilitating.  It sounds like she either has a medical or mental condition.  She needs help, and for the sounds of it, you want to help her.  I suggest that you take the time to contemplate the best way and time to approach her.  Rehearse ahead of time what you want her to hear and what the end goal is.  I know it might seem like a lot of work for you to do and perhaps you even feel frustrated about that, but the only way you will reach her is if you approach it in a way she hears your concern and desire to help her.  Be prepared with facts and places to go for help.  The better prepared you are, the better the chances of her to act on it.  Remind her how much you love her and how it is not healthy for her or for the relationship for this to continue.  With lots of love and patience, you can make a difference.  Stay Strong!Best of luck to you and your daughter, Mirella~"
                ],
                "history": [
                    "There is just no communication at all between us. She sleeps constantly all day (not at night). She acts angry and unfocused and stays in her very messy room all the time. The only time she comes out is to eat.    She has aches and fatigue, weight gain, hair loss and skin problems. She does not look after her health.\n   I don't know how to communicate with her. She is not open to any suggestions. How do I get through to her?"
                ]
            },
            {
                "candidates": [
                    "I'm sorry for what sounds like a frustrating situation.For how long has your daughter lived the way you describe and did it start all of a sudden or more gradually come on?What you write sounds like a major depressive disorder and this can start for a variety of reasons and improve in just as many different ways.Start with how you are feeling about the situation.  Ask yourself for how long you will be able to tolerate the way your daughter lives and if you feel any satisfaction in your mother daughter relationship.If she is of legal age, and you don't want her to live with you,  you've tried convincing her to get medical care for its own sake and to more clearly see her emotional and psychological health, and she is unwilling to take care of herself, you can discuss your options with the adult protective services agency in your state.The first step is to know what exactly is her problem so you can decide if its own you are willing to take care of or not."
                ],
                "history": [
                    "There is just no communication at all between us. She sleeps constantly all day (not at night). She acts angry and unfocused and stays in her very messy room all the time. The only time she comes out is to eat.    She has aches and fatigue, weight gain, hair loss and skin problems. She does not look after her health.\n   I don't know how to communicate with her. She is not open to any suggestions. How do I get through to her?"
                ]
            },
            {
                "candidates": [
                    "1. She's an adult.2. She lives in your house? She follows your rules.3. What you're describing could be any number of things, but could potentially be a medical issue that needs attention. Thyroid issues, autoimmune diseases - there's a ton of medical possibilities for her symptoms. I'm not a doctor; this is a forum of therapists.4. I recommend the book \"Codependent No More\" which may help you navigate your rocky relationship with your adult daughter. You may be inadvertently making things worse by \"helping\" her which can instead enable her to continue her behaviors. Another book you may find helpful is \"Boundaries: Where you end and I begin\". You cannot control another person, especially an adult. The only person you can control is yourself. Tough love is sometimes needed, and she is an adult - treat her like one. Maybe then she'll act like one. If we were having this conversation in person, you would interrupt me at this point with a \"but...\" and then explain all the reasons why you can't tell her to move out, get a job, get up and cook or clean the house, etc. I already know that you have a myriad of excuses for things being the way they are. Yes, I said excuses instead of reasons, because that's what they are. You may feel stuck and like you have to take care of her, but you have choices - you just may not like them. I know that when children are small, parents' lives are focused around them (some more than others) and decisions are made around what is best for your child. But you said your daughter is an adult. The relationship dynamics must change if the relationship is to be a healthy one. I know how difficult it is to watch your child make life choices that you wouldn't want for them, no matter what that choice may be. As a parent, we want to force them to do what we think is \"the right thing\" but trying to do that only results in frustrations for everyone involved. Whether the issue is a hair color, a tattoo, a lifestyle choice, a job, or choosing not to work or take care of their health, or doing drugs, or drinking - the choice is theirs and theirs alone and so are the consequences of those choices."
                ],
                "history": [
                    "There is just no communication at all between us. She sleeps constantly all day (not at night). She acts angry and unfocused and stays in her very messy room all the time. The only time she comes out is to eat.    She has aches and fatigue, weight gain, hair loss and skin problems. She does not look after her health.\n   I don't know how to communicate with her. She is not open to any suggestions. How do I get through to her?"
                ]
            },
            {
                "candidates": [
                    "A lot depends on the age of your child, but given that it was a mis-used debit card, I am going to guess he's a teen?  Assuming that, there are a couple of important things to keep in mind...1.  That he lied about the misuse indicates he knows he was in the wrong.  That's a dreadful feeling - getting caught out- and an impulsive lie may have popped out of his mouth before he thought it through (after all a debit spend is pretty easy to track).  2. Once he lied he stuck with the lie.    Somewhere along the line, even though he knew that you knew he wasn't telling the truth, he stuck with his story.  And as you said, it's not the first time he lied.  Now it looks like a habit has formed.Going forward, when there is a dishonest act of any kind, it's essential that you set it up so your son can be truthful.  Simply put, do not ask questions.  If you know for certain that he has, for example, misused your debit card, say so.  Asking \"did you\" invites him to get creative with denial; asking \"why did you\" implies that, with a good enough reason, he might not be in hot water with you.  Instead, say what is:  \"I see this charge on my debit card and realize you used it without my permission\".  (You can only do this if you know for sure it was him but it sounds like you do).  If he meets with denial, stay calm, restate that you are aware this happened.  Then deliver consequences that match the transgression (he has to return the item if it's returnable or find a way to pay you back for the charge as well as any fees incurred in using it).  Make it harder to find your card because he isn't that great at curbing the impulse to use it yet.And most importantly, once the consequence is delivered you have to let it go.  Continuing to bring it up won't benefit him, but it does have the potential to make him more sneaky.  Every time he asks respectfully to use it, whether you allow him to or not, be sure to praise him for asking nicely.  \"Catch\" him doing it right as often as possible.Hang in there - this isn't super unusual behavior but it isn't acceptable, so address it but don't let yourself get too wound up about it."
                ],
                "history": [
                    "My son stole my debit card and lied about it. It's not the first time he has lied. I don't know what to do anymore. I don't know if I should punish him or make him do something. I've tried talking to him and asking if anything was wrong. I have grounded him, but nothing works. What should I do?"
                ]
            },
            {
                "candidates": [
                    "Hi Enid, You sound like a sensitive parent; I like that you talked to your son to see if anything is wrong. There is some key information here (I don't know your son's age, whether he spent any money, whether he put the card back, or how many times he's stolen), and my answer might be different depending on those details, but I'll give you my thoughts.I see it as every child's job to figure out the rules and find where their power is in the world. In order to accomplish that, many of them test limits. \"What can I get away with?\" is a question they have to find the answer to. If a child knows the rules, they're much more likely to not test limits (because they already know the limits). So, part of testing limits is experimenting with stealing and lying. Not all kids steal, but I would say pretty much every child lies at some point. It's a normal behaviour, and most of the time it's about small things that don't matter and we don't even find out. Stealing a debit card is a bit more serious, and I'm not surprised he lied about it. If you absolutely know that he took it, it's okay to tell him that you believe he did this thing and also lied about it. It's appropriate to give a consequence for this type of behaviour, so that the child doesn't do it again. The consequence should be as natural and logical as possible. The behaviour (stealing) was harmful to you, so doing you a favour with extra chores might be a good idea. It's funny, because as parents we try to tell our kids that lying is bad, but they know they'll get a consequence if they tell the truth so there are natural deterrents to being honest (we don't want people to know our mistakes). It's a dilemma. If you really want to focus on the lying part, you can tell him that you won't give him a consequence for the lying if he decides to come clean with the truth within one day. That gives him incentive to come to you with truth. It sometimes works with kids to give them a chance to come clean and then reward them for telling the truth. You can set your child up for success and train them to tolerate honesty. Put a cookie on the counter. Tell your child to take the cookie at some point in the day. Then ask them later if they took the cookie. You're making honesty fun. Kids love games. Basically, there's as much power in rewarding the positive behaviour as punishing the negative. If this is the first serious offence for your son, don't make a big deal of it; consequence him and see if he learns. If it's a pattern, that's different and you may want the input of a therapist."
                ],
                "history": [
                    "My son stole my debit card and lied about it. It's not the first time he has lied. I don't know what to do anymore. I don't know if I should punish him or make him do something. I've tried talking to him and asking if anything was wrong. I have grounded him, but nothing works. What should I do?"
                ]
            },
            {
                "candidates": [
                    "It is great that you are noticing these changes with your daughter. I can’t offer advice without knowing much more about your particular situation but some things to think about:Has something else happen recently that has been stressful, upsetting?Is your daughter trying to communicate something to you and if so what might that be?Have you discussed these recent changes with her? (Without being too serious or accusatory)There is so much changing for her (and you) now-communication and connection are crucial. I hope you both can talk to a supportive person about all these changes."
                ],
                "history": [
                    "I'm concerned about My 12 year old daughter.    About a month or two ago she started walking on her toes, as well as coloring and writing very messy. This all happened very suddenly. She has never walked on her tiptoes and has always colored and written very neatly.    Is this something I should be concerned abou? Any advice will help."
                ]
            },
            {
                "candidates": [
                    "Have you asked your daughter why she's doing the behaviors you describe?Often the best way to find out why someone does something is to simply ask them their reason.Her answer will give you some guidance as to next possible steps.If she's pretending to be a fantasy figure or trying to find out how being taller feels, or walking on high heels or some other image then knowing this rules out that she has some unbearable pain in her arch which may require more practical answers such as new shoes or even indicate a medical problem.Ask if she's noticed any change in the way she walks.   Maybe she doesn't know she's doing this and maybe she feels embarrassed to tell you she's doing something a bit odd.Since usually 12 year olds don't color, is it new that she started coloring?Maybe given the fact of messy handwriting, she's in a phase of pretending or reflecting on good times as a young child.Then this becomes the topic of examination.Does she feel insecure about being on the cusp of adolescence?Some of these questions can be asked directly and some are for you to first decide based on what you know of your daughter, which questions and what direction to take in understanding your daughter's motivation."
                ],
                "history": [
                    "I'm concerned about My 12 year old daughter.    About a month or two ago she started walking on her toes, as well as coloring and writing very messy. This all happened very suddenly. She has never walked on her tiptoes and has always colored and written very neatly.    Is this something I should be concerned abou? Any advice will help."
                ]
            },
            {
                "candidates": [
                    "This is your experience, your feeling and you are wondering if it is normal, which means is this common or the rule. This question about how you feel about your third child leads me to believe you are dis- turbed [etymology: agitated or stirred up].  Feelings are messages from our soul or spirit that something is not right.  So, though  it might be normal [common, the rule]  to look forward to a one year olds nap time when you have a three year old a nine year old, the dis- turbance or stirring up in you, is important and requires your attention, your listening, if you will to your higher self."
                ],
                "history": [
                    "I have three children. The oldest is nine and not my biological child. The middle child is three and the youngest is one. I have a great relationship with the oldest two children but I haven't developed the same level of attatchment to the youngest child. I rarely want her around and look forward to her nap times. Is this normal?"
                ]
            },
            {
                "candidates": [
                    "This is a common response parents can have.  There are many reasons for attachment disruption.   But attachment is  important for the child as well as your long term relationship with them.    I would want to know more about the history of the child and any stressors you have gone through during the child's lifetime.  Often if there is stress parents will not have the time or energy to attach well to the child.  Sometimes the energy of the child and the parent are mismatched as well.  But whatever is at the core this is something that can be addressed in counseling.  The earlier the better because adult relationships are based on parental relationships we had as children.  Therapy can start at age 3 to address these types of issues.  Visit staceybshapiro.com for more information about getting started."
                ],
                "history": [
                    "I have three children. The oldest is nine and not my biological child. The middle child is three and the youngest is one. I have a great relationship with the oldest two children but I haven't developed the same level of attatchment to the youngest child. I rarely want her around and look forward to her nap times. Is this normal?"
                ]
            },
            {
                "candidates": [
                    "Congrats on being honest about the way you feel!Many people state having a favorite child so the reverse would also be possible, of having a least favorite child.Try to understand your own reasons for not liking your youngest child as much as the others.One point to consider is whether it is the child' personality or the way they interact with you which gives you the feeling of not liking this child as much as the others, or does the reason have more to do with younger children requiring more care?Also, do you generally prefer older kids to younger ones?   It is possible the problem will go away as your youngest grows older.Is there another parent in the household who can make up for what you feel unable to naturally give to your youngest?Is it possible you feel your own need to be involved with activities or to have time on your own?   Maybe you simply need a break from constant mothering.Continue to give as much as possible to your youngest child."
                ],
                "history": [
                    "I have three children. The oldest is nine and not my biological child. The middle child is three and the youngest is one. I have a great relationship with the oldest two children but I haven't developed the same level of attatchment to the youngest child. I rarely want her around and look forward to her nap times. Is this normal?"
                ]
            },
            {
                "candidates": [
                    "You seem to have been a very positive influence in your kids' lives.They may have worked so hard because they understood how difficult and tiring your life was as a single mom.I feel you are seeing your kids' lives through the measurement of how much toil was in your life as a single mom.In other words, what you see your kids overlooking or not appreciating, may remind you of your wishes during the many years you raised your kids.If it helps you and is possible, then maybe you could spend more of your own time tougher with your grandkids.  This may give some reward for the many years you spent working to support your kids and had no choice in the amount of time you had with your kids.As far as your kids relationship to their kids, it is now their turn to raise them as they wish, within ethical boundaries of course.Depending on the topics you and your kids talk about, consider to bring up your concern as to whether they feel their kids, your grandkids, are missing anything due to the limited time they have with the parents."
                ],
                "history": [
                    "I was a single mom most of their growing up life and have guilt about trying to work three jobs and being gone a lot. My children are successful with their own business's, have lots of nanny and cleaning help, but I just feel they have such a great opportunity to spend it with their kids."
                ]
            },
            {
                "candidates": [
                    "Well, first let's identify what factors are involved in the situation about which you wrote.Are you the only decision maker regarding your stepdaughter living with you?Is her dad, and your partner, living under the same roof?Would you feel any obligation to consult with your husband about his opinion and his way of handling the situation?Have you talked with your stepdaughter about your observation and your reaction to the fact of her not honoring your boundaries?Consider too that there will be an effect on the toddler, your grandchild, if you kick out your daughter.Is your daughter financially ready to live on her own and support herself and her child?You certainly have the right to define the terms of what goes on under your roof.It is only fair to everyone that as many variables as possible, be considered.The conclusion may be that it is in everyone's best interest for your stepdaughter to move out.If everyone feels respected and a well thought out plan is developed, then the least amount of hurt and stress, and the most amount of happiness, will be possible from this change."
                ],
                "history": [
                    "She's in her early 20s, and she has a toddler."
                ]
            },
            {
                "candidates": [
                    "This is something you will have to discuss with your husband.  It should be a joint decision if you value your marriage.  You can mention your frustration about your stepdaughter not honoring boundaries.  After you talk to your husband you both can have a talk with your stepdaughter about expectations in order to stay living in the house.  When it comes to stepchildren you need to be very careful you do not take the lead on the authority part.  It should be the biological parent."
                ],
                "history": [
                    "She's in her early 20s, and she has a toddler."
                ]
            },
            {
                "candidates": [
                    "It may be helpful to first have a discussion about what you are expecting and put a timeframe on it that if she is not doing certain things by a certain date, she will have to leave. If you don't know where she can go, there is probably a list of shelters for the county that you live in."
                ],
                "history": [
                    "She's in her early 20s, and she has a toddler."
                ]
            },
            {
                "candidates": [
                    "Oh my goodness, my heart goes out to you!!  I pray you have other strong and supportive loved ones or friends surrounding you. If you are in school, please consider speaking with a counselor on site who can help give you some good coping mechanisms as well as other resources.I believe most therapists would agree that this type of behavior is indicative of emotional AND verbal abuse. And quite often the two overlap because someone who is being yelled at and demeaned is also frequently having his/her emotions preyed upon as well. Healthy Place offers us some great examples of emotional abuse which certainly fit the criteria of what you describe:Yelling or swearing Name calling or insults; mocking.Threats and intimidation.Ignoring or excluding.Isolating.Humiliating.Denial of the abuse and blaming of the victim.And abuse survivor and author, Kellie Jo Holly, offers some other great examples of verbal abuse:Emotionally Abusive StatementsYou’re so cute when you try to concentrate! Look at you trying to think.I can’t believe I love a stupid jerk.Aw, come on, can’t you take a joke?Sexually Abusive StatementsYou should know how to please me by now.I hoped you were less experienced.Stop acting like a whore.Financially Abusive StatementsYou are going to nickel and dime me to death!In what world does buying that make sense?Fine. You handle your finances. Let me know when things go to hell.Societally Abusive StatementsHow dare you spread around our private business!Let me do the talking; people listen to men.You took a vow in front of God and everybody and I expect you to honor it!Threatening and Intimidating StatementsIf you don’t train that dog I’m going to rub your nose in its mess.I will take our kids if you leave me.You’re scared?! This isn’t angry! You will KNOW when I’m ANGRY!Spiritually Abusive StatementKeep your stupid beliefs to yourself.God will find a way to get you back, and it ain’t gonna be pretty.I can feel myself being pulled into hell just listening to your nonsense!It's been my personal clinical experience that children who are experiencing the types of things you describe often say they feel misunderstood, lonely, or scared and don't want to make things worse by standing up for themselves. Even if you feel you can't defend yourself outwardly, that doesn't mean your father's awful and toxic behavior is something you should ever internalize (i.e., believe to be true) which is why I hope you are surrounding yourself with people who will speak life and positivity back over you.  We are ALL worthy of respect, love, and kindness. Don't ever forget that!My love and light to you hon.Tamara Powell, LMHC"
                ],
                "history": [
                    "My dad is always, and I mean always, cussing and screaming at me for no reason at all. He makes me feel stupid. He also compares me to my other siblings in a negative way and demeans me. Is this abuse?"
                ]
            },
            {
                "candidates": [
                    "I'm really sorry to hear that you are going through this.It's a little difficult to answer your question because the laws that define child abuse are different from state to state. But usually, things like what you describe your dad is doing are not considered to be child abuse.The more important thing is how you feel about what is going on. It sounds like this is really bothering you.If you don't think you can talk to your dad about how you feel, you might want to try talking to another adult you trust (like a family member or teacher). They may be able to help you figure out some ways to communicate with your dad.I think you might feel better if you can talk to someone about how your are feeling."
                ],
                "history": [
                    "My dad is always, and I mean always, cussing and screaming at me for no reason at all. He makes me feel stupid. He also compares me to my other siblings in a negative way and demeans me. Is this abuse?"
                ]
            },
            {
                "candidates": [
                    "Yes, this emotional abuse.  There is no abuse without emotional abuse.  His abuse is demeaning and can have lasting negative impact on your perspective of your self and people around you.  Please find someone support to talk to."
                ],
                "history": [
                    "My dad is always, and I mean always, cussing and screaming at me for no reason at all. He makes me feel stupid. He also compares me to my other siblings in a negative way and demeans me. Is this abuse?"
                ]
            },
            {
                "candidates": [
                    "Everyone deserves to be treated with dignity and respect. Having said that, everyone gets upset once in awhile and may yell or scream, which can be disrespectful. You said \"always, and I mean always\" and that is troubling. If your dad curses and screams at you on a regular and consistent basis, it can (as you stated) impact the way you feel about yourself. While the definitions of child abuse differ from state to state, talking to someone can help. Perhaps there is a counselor at school, or another trustworthy person you could confide in to help you understand how this situation is impacting you? Counseling is a good option. There is also help available through the national hotline at 1-800-422-4453, 24 hours a day, 7 days a week. You can call (press 1) and talk to a counselor while being anonymous. You can also check out this website: https://www.childhelp.org/hotline/resources-kids/I am sorry that you are going though this situation. There is help available. You do not have to go through this situation alone."
                ],
                "history": [
                    "My dad is always, and I mean always, cussing and screaming at me for no reason at all. He makes me feel stupid. He also compares me to my other siblings in a negative way and demeans me. Is this abuse?"
                ]
            },
            {
                "candidates": [
                    "Yes, screaming and cussing at your child is considered abuse.Here are two points I suggest you consider for your situation.If your dad is ever calm when you and him are with one another,  ask for some time to talk about your relationship with him.Schedule it for sometime in the near future from your request.   This way he has time to consider his points of view on his relationship to you.  Even if he does no thinking about your relationship at all, he will not feel pressured by the surprise of suddenly being expected to talk about a topic he may prefer to prepare himself.My second point to you is to keep steady in your own views of who you are.  When a parent demeans and mistreats a child, the child is affected in a negative way.  Concentrate on loving yourself and keeping people in your friendship circle who care about you."
                ],
                "history": [
                    "My dad is always, and I mean always, cussing and screaming at me for no reason at all. He makes me feel stupid. He also compares me to my other siblings in a negative way and demeans me. Is this abuse?"
                ]
            },
            {
                "candidates": [
                    "Your nephew's behavior sounds normal and developmentally appropriate.  Masturbation is a healthy expression of sexuality.  Most families to create some rules about where it's ok to masturbate-- for example, stating that it should be done in the privacy of the child's own room.  I'm wondering if you or another adult in his life have talked to him about his developing sexuality?  It seems like that would help him and you handle his increasing maturity."
                ],
                "history": [
                    "My step nephew, a preteen, has begun masturbating. I also had to take away the internet because he was caught looking up porn. I’m worried about him."
                ]
            },
            {
                "candidates": [
                    "There's two things this post relays - one, which I'm sure you've already looked into - is working with the school to address this problem. Sure, sometimes kids don't get along, but most schools look at bullying seriously, and this sounds serious. The other, though, is additional tools to consider to help your daughter. If you haven't already read Greene's Explosive Child, you might give it a shot. While it's a little preachy, many of the tools are wonderful and can help parents navigate tantrums. https://www.amazon.com/Explosive-Child-Understanding-Frustrated-Chronically/dp/0062270451 Another tool that can redirect a child that's losing it is a task. If her tantrums, say, involve throwing things, maybe she's in charge of throwing all the sticks and acorns off the driveway into the garbage bin. Ie: 'Hey Jenny, you seem really angry right now, let's use all that energy and get some work done!' Go with her, throw with her, even - if possible - making a game out of getting the acorns into the bin from a distance. I wish you all the best~"
                ],
                "history": [
                    "We have tried gentle talking, counting to calm her and talking about it, sending her to her room and then trying to talk when she’s calmer, and now calisthenics. However, nothing is working."
                ]
            },
            {
                "candidates": [
                    "Financial stability is probably a good place to start your new life project.If your partner doesn't work or doesn't contribute his money to the household bills, then maybe you are eligible  for some type of stipend from the government.Especially since you have kids the child welfare service may intervene to help you.  Sometimes too, a partner who is unwilling to pay for their kids' wellbeing may be pressured by child welfare to make regular contributions to you and your kids.I''m glad you are thinking of your needs and those of your kids.  This is the philosophy which will show you what road to follow so all three of you are in a secure financial place."
                ],
                "history": [
                    "I am in my 30s with 2 kids and no job and I'm behind on the bills. I've been trying everything with no results. I feel like everyone else puts their needs in front on mine. I give intil it hurts and I'm afraid that I'm going to fail my babies    I've been struggling for 5 yrs in a relationship with no communication and no alone time. How can I get some support?"
                ]
            },
            {
                "candidates": [
                    "I would want to know where do you put your needs? Often times we show people how to treat us based on how we treat ourselves. First identify how to practice good self care which can only happen when you are authentic and real about your needs and desires. You cannot pour from an empty cup and must take find the time to explore your purpose in life. It may be helpful to seek out additional support to work on your intrapersonal relationship."
                ],
                "history": [
                    "I am in my 30s with 2 kids and no job and I'm behind on the bills. I've been trying everything with no results. I feel like everyone else puts their needs in front on mine. I give intil it hurts and I'm afraid that I'm going to fail my babies    I've been struggling for 5 yrs in a relationship with no communication and no alone time. How can I get some support?"
                ]
            },
            {
                "candidates": [
                    "You wrote a very full family context w many directions to examine.Do you know or can you find out what the grandma and your daughter were doing in the evening of the screaming episode?Is it possible the grandma abuses your daughter, or tells her scary stories, watches scary movies.  These are only suggestions of some problem between grandma and your daughter.Also, ask your daughter directly why she wants to kill herself and what' killing herself\" means.   Seven year olds don't have a concept of death being a forever condition.  Seven year olds don't have a sense of future meaning besides liking/disliking them.   Maybe the new baby is a factor.  Do you feel this is a factor?   Trust your intuition to tell you if your daughter is resentful of your new baby.Even if she is, I doubt a seven year old has the capacity to connect current unhappiness with the intention of a future action, including suicide."
                ],
                "history": [
                    "My daughter was overly tired and throwing a fit at her grandparent's house. She wanted to come home at midnight and cried screamed said she said she hated her grandma and that she wanted to kill herself!\n    We also have a new baby in the house i didn't know if this would contribute to this. How should I approach this?"
                ]
            },
            {
                "candidates": [
                    "The true answer is, \"no one can really say with certainty\".The variables are the way this child absorbs and adjusts to these significant changes in their life.  All anyone can do is guess at this point and there's no good reason to guess.The only general certainty is that the adult whom this child becomes will have had a profound encounter with the biggest types of human losses a child can go through.Some people become great teachers, therapists and philosophers who have this background.  Some give up on life and hide away from others.The best anyone could do who knows this child is to offer love bc this is the greatest guarantee to show there are good people on this earth."
                ],
                "history": [
                    "The birth mother attempted suicide several times while pregnant. The adopted mother was terminally ill upon adopting the baby and died when the child was just over one year old. The adopted father then remarried to a physically, psychologically, and emotionally abusive woman. The child was placed in foster care at 11 years old.    What might be the long term effects on an adult with this childhood history?"
                ]
            },
            {
                "candidates": [
                    "Parents are to teach discipline to children, not punishment.   Punishment is another word for wanting to cause hurt.  There is a different in discipline and punishment.  Punishment could have long term affects on a child's self image and growth.  It can lead to others issues such as bullying from peers as well.  Whatever your grandson has done, there is a much better way of getting him to understand that his actions are not acceptable.  Punishment is not one them.  Encourage the step-mother to build a positive relationship with him, this way he will learn to respect and trust her.  His actions would improve.  She may need to attend a parenting class for blended families."
                ],
                "history": [
                    "My grandson's step-mother sends him to school with a pink Barbie backpack as a form of punishment."
                ]
            },
            {
                "candidates": [
                    "Absolutely not! It is never in a child's best interest to use humiliation as punishment. This can lead to issues in the relationship between parent and child as well as the child's social relationships. Kids have a hard enough time. To then go and cause them embarrassment is unconscionable. The entire job of a parent is to prepare their child to become a successful, healthy adult. You do this by using healthy ways to teach a child when they make a mistake. Discipline shouldn't be seen as punishment. It should be seen as a way to teach a lesson. What lesson could this possibility be teaching him? Absolutely nothing. Meanwhile, she is most likely damaging her relationship with him and causing great distress in his school day and peer interactions. She should be one of the people he can come to when he's hurting; not someone who causes him pain."
                ],
                "history": [
                    "My grandson's step-mother sends him to school with a pink Barbie backpack as a form of punishment."
                ]
            },
            {
                "candidates": [
                    "Hi!   I'm sorry you are having such a tough time with this situation.  I have worked with a number of young adults in their 20's who have had to move back home after college , or even stay at home through the college years.  Bottom line is that either way , it is so difficult when you are trying to discover who you are and what you want your life to be , to have to live at home.   I have even heard much older adults clients  say that when they visit their childhood home , they suddenly feel like a \"kid\" again .  The old dynamics between adults and their parents and siblings can pop right up as if they have gone back in time and are no longer adults !I would suggest that you approach your mom and say something like \"I am hoping we can talk about the best way for us to manage me living here.  I really appreciate that you are giving me a place to live until I get on my feet , and I want to be respectful of you and our home ; at the same time , though, I feel like it's important for me to have more independence than when I was younger because I am growing up and trying to learn more about myself and become more autonomous. Can we talk about what might be fair rules that we can  both live with ?\" If she is receptive , maybe you can each write a separate list of what you think would be fair and reasonable and then compare lists and try to make compromises and come up with a list of \"guidleines\" that feel fair to you both .   If this is too hard to do alone , perhaps you and your mom can meet with a therapist a few times who can help you to come  up with some kind of \"compromise contract.\"   This is not an easy situation , but if you can approach your mom in a calm and \"mature\" way and suggest a planned, structured discussion that doesn't take place in the heat of the moment , your mom may be impressed by your maturity and even more receptive to working out some rules that you can both live with.Good luck !!Elissa Gross"
                ],
                "history": [
                    "I am in my early 20s and I still live with my parents because I can't afford to live alone.\n   My mother says that if I live under her roof I have to follow her rules. She is trying to control my life. What should I do?"
                ]
            },
            {
                "candidates": [
                    "Hello. Even though legally you are an adult, it is a matter of courtesy to respect the homes of your parents. As long as you live there, you should be considerate of their needs. At the same time, there should be conversation about what each of you considers appropriate as it pertains to communication between a parent and an adult (even though you are still her offspring). This will require openness, honesty, and a willingness to give from both sides in a respectful way. Healthy boundaries can be established and honored when each is willing to do their part in this new relationship. Your mother knows you are an adult, but has not had as many years of treating you like one. So mentally and emotionally this will take some time for her to adapt. Share your concerns with her, and see if you can come up with a set of rules that you both can honor. It will be a great stepping stone for both of you as you move into this new chapter together as you begin relating a little differently.Reach out for help to a counselor if needed. You don't have to sort this out on your own. And lastly, take good care of yourself in the process. You are moving through some exciting times in your life. The more you can have support as you explore new events, the better you might feel less stressed.Warm regards."
                ],
                "history": [
                    "I am in my early 20s and I still live with my parents because I can't afford to live alone.\n   My mother says that if I live under her roof I have to follow her rules. She is trying to control my life. What should I do?"
                ]
            },
            {
                "candidates": [
                    "Unfortunately you seem to have yourself in a double bind. By living with your mom she is not going to stop her attempts at what you perceive as \"controlling\". There is no use in trying to debate or get her to \"see your point\". As long as your there and you personalize her attempts at control, then you will find yourself frustrated and resentful. Try to find an extra job or a roommate so that you can do the natural process of moving on out.www.lifecounselingorlando.com"
                ],
                "history": [
                    "I am in my early 20s and I still live with my parents because I can't afford to live alone.\n   My mother says that if I live under her roof I have to follow her rules. She is trying to control my life. What should I do?"
                ]
            },
            {
                "candidates": [
                    "Unfortunately I think most of us have heard this, so you are not alone.  If you are still under her roof she has leverage as to what her expectations are while you are living there.  I would consider therapy for the both of you to see if there could be a middle ground that could be agreed upon.  Often times a 3rd party can help with conflict.  If there is no resolution then I would look to get creative in finding a place of your own."
                ],
                "history": [
                    "I am in my early 20s and I still live with my parents because I can't afford to live alone.\n   My mother says that if I live under her roof I have to follow her rules. She is trying to control my life. What should I do?"
                ]
            },
            {
                "candidates": [
                    "Hello. It sounds like you and your parents are not balanced in your communication and awareness of expectations. Your growth is not only reflected in your ability to understand and apply new knowledge and skills, it is also reflective of your parents acceptance of your understanding and application. Have you tried talking with your parents to let them know your concerns?This talking is best when face to face and during non active conflict ( can't begin stating rules during an argument, etc). Sometimes it is even helpful to write down ways you feel you can be supported by them and supportive to them. Maybe share this list or reflective piece with them to review, or use when communicating the expectations. Unfortunately, until there are clear expectations stated and expressed, the scale will be uneven and frustrations will increase. Dr. T"
                ],
                "history": [
                    "I am in my early 20s and I still live with my parents because I can't afford to live alone.\n   My mother says that if I live under her roof I have to follow her rules. She is trying to control my life. What should I do?"
                ]
            }
        ]
    }
]